{"type":"entity","name":"WASH Professional","entityType":"Professional","observations":["Extensive experience in humanitarian WASH projects","Has worked across multiple countries including Kenya, Tanzania, Jordan, South Sudan, Ecuador, Nigeria, and Sudan","Specializes in emergency response and refugee camp operations","Professional experience spans from 2007 to present","id: \"a1b2c3d4-e5f6-7890-abcd-ef1234567890\""]}
{"type":"entity","name":"Technical Skills","entityType":"SkillSet","observations":["Water supply and sanitation engineering","Emergency response coordination","Project management and supervision","Technical design and implementation","Field assessment and monitoring","Capacity building and training","id: \"b1c2d3e4-f5a6-8901-bcde-f01234567890\""]}
{"type":"entity","name":"Humanitarian Organizations","entityType":"Organization","observations":["International Federation of Red Cross and Red Crescent Societies (IFRC)","Oxfam GB","Norwegian Refugee Council (NRC)","International Medical Corps (IMC)","International Organization for Migration (IOM)","id: \"c1d2e3f4-a5b6-9012-cdef-0123456789ab\""]}
{"type":"entity","name":"Project Contexts","entityType":"WorkContext","observations":["Refugee camp WASH infrastructure development","Emergency drought response operations","Post-earthquake humanitarian assistance","Urban water supply and sanitation planning","Conflict zone humanitarian operations","id: \"d1e2f3a4-b5c6-0123-def0-123456789abc\""]}
{"type":"entity","name":"Peter A. Wereh","entityType":"Person","observations":["Professional Title: WASH Specialist","Location: Nairobi, Kenya","Contact: +254 727 358 392, wereh.achieng@gmail.com, wereh.achieng@outlook.com","id: \"e1f2a3b4-c5d6-1234-ef01-23456789abcd\""]}
{"type":"entity","name":"Professional Experience","entityType":"Experience","observations":["Job Title: Project Officer WASH","Organization: IOM","Location: Sudan","Year: 2024","id: \"f1a2b3c4-d5e6-2345-f012-3456789abcde\""]}
{"type":"entity","name":"Education","entityType":"Education","observations":["Degree: BSc. Water and Environmental Engineering","Institution: Egerton University, Kenya","Years: 2002-2007","id: \"a2b3c4d5-e6f7-3456-0123-456789abcdef\""]}
{"type":"entity","name":"References","entityType":"Reference","observations":["Name: Tomas Lopez de Bufala","Position: Chief of WASH","Organization: UNICEF | Angola","Contact: (+244) 912 653 016, tomaslopezdebufala@gmail.com","id: \"b2c3d4e5-f6a7-4567-1234-56789abcdef0\""]}
{"type":"entity","name":"Gyula Kadar","entityType":"Reference","observations":["Position: Regional Operations Manager","Organization: IFRC | Sierra Leone","Contact: (+232) 79 423686, gyula.kadar@ifrc.org"]}
{"type":"entity","name":"Syed Yasir Ahmad","entityType":"Reference","observations":["Position: Global WASH Advisor","Organization: International Medical Corps (IMC) | UK","Contact: (+44) 7424 927 611, syahmad@internationalmedicalcorps.org.uk"]}
{"type":"entity","name":"Assistant Construction Supervisor","entityType":"Position","observations":["Organization: GIBB Africa","Location: Kenya","Duration: 2007 - 2008","Project: Sasumua Dam Emergency Measures","UUID: WASH-07-GIBB-ACS-KEN","Context: Involved in the Sasumua Dam Emergency Measures (SDEM) project, addressing critical water infrastructure repairs and improvements following damage from extreme weather events.","Project Description: Involved in the Sasumua Dam Emergency Measures (SDEM) project, addressing critical water infrastructure repairs and improvements following damage from extreme weather events.","Key Responsibilities: Assist in supervision of emergency construction works, conduct daily site inspections and quality control checks, monitor construction progress and report on daily activities, assist in material testing and approval processes, conduct surveys for setting out and monitoring levels and slopes, maintain photographic records of construction progress, prepare site meeting minutes and assist with correspondence, support certification of payments and preparation of completion reports.","Major Achievements: Contributed to successful construction of a 15m high earth fill cofferdam, assisted in overseeing construction of an emergency earth spillway channel, participated in controlled demolition and reconstruction of damaged spillway sections.","Technical Highlights: - Involved in construction of a secant bored pile wall curtain - Assisted in implementation of cyclopean concrete weir construction - Gained experience in emergency hydraulic structure repairs and modifications","Key Metrics: - Supervised construction of 15m high earth fill cofferdam - Managed daily site inspections for 100+ construction days - Coordinated material testing for 500+ samples","Skills Demonstrated: - Project management and coordination - Quality control and assurance - Technical report writing","Technical Documentation Produced: - Daily site inspection reports - Quality control checklists - Construction progress photographs","Collaborations/Partnerships: - Worked with local contractors for construction projects - Coordinated with material suppliers for quality assurance - Partnered with government agencies for compliance","Collaborations/Partnerships: - Local construction firms for project execution - Material suppliers for quality materials - Government agencies for regulatory compliance","id: \"c2d3e4f5-a6b7-5678-2345-6789abcdef01\""]}
{"type":"entity","name":"Graduate Engineer/Assistant Engineer (Design)","entityType":"Position","observations":["Organization: GIBB Africa","Location: Various (primarily Tanzania)","Duration: 2008 - 2009","Project Context: Water supply and sewerage projects","UUID: WASH-08-GIBB-AE-VAR","Context: Involved in water supply and sewerage projects in urban areas of Tanzania, focusing on expanding and improving WASH infrastructure to meet growing urban demands.","Project Description: Involved in water supply and sewerage projects in urban areas of Tanzania, focusing on expanding and improving WASH infrastructure to meet growing urban demands.","Key Responsibilities: Assist in detailed engineering design for water supply and sewerage systems, participate in water demand data collection and analysis, contribute to preliminary and detailed designs of water supply works, assist in production of engineering drawings and cost estimates, support preparation of tender documents, conduct site visits for project assessments and surveys, contribute to technical report writing.","Major Achievements: Contributed to detailed engineering design for Shinyanga Water Supply & Sewerage Project, assisted in design of water supply systems for Maswa and Kishapu Townships, Kahama and Ushirombo, participated in design of firefighting infrastructure for New Bugesera International Airport, Rwanda.","Technical Highlights: - Utilized WaterCAD for basic water distribution system modeling - Assisted in design of water treatment facilities for urban systems - Contributed to development of sewerage master plans","Key Metrics: - Contributed to design of 3 major water supply systems - Assisted in production of 200+ engineering drawings - Participated in 50+ site visits for project assessments","Skills Demonstrated: - Engineering design and analysis - Technical drawing and documentation - Site assessment and evaluation","Technical Documentation Produced: - Engineering design reports - Technical drawings and schematics - Site visit assessment reports","Collaborations/Partnerships: - Collaborated with senior engineers for design projects - Worked with local authorities for project approvals - Partnered with survey teams for site assessments","Collaborations/Partnerships: - Senior engineers for mentorship and guidance - Local authorities for project approvals - Survey teams for accurate site data","id: \"d2e3f4a5-b6c7-6789-3456-789abcdef012\""]}
{"type":"entity","name":"Water Supply Design Consultant","entityType":"Position","observations":["Organization: LOSAI Management Limited","Location: Kamiti, Kiambu County, Kenya","Duration: September 2010","Project Context: Comprehensive water reticulation system","UUID: WASH-10-GIBB-PM-KEN","Context: Design consultancy for comprehensive water reticulation system serving new 93-hectare mixed-use development along Nairobi-Kamiti road, requiring integration with existing NCWSC infrastructure and consideration of future growth projections.","Project Description: Design consultancy for comprehensive water reticulation system serving new 93-hectare mixed-use development along Nairobi-Kamiti road, requiring integration with existing NCWSC infrastructure and consideration of future growth projections.","Key Responsibilities: Lead detailed design of water reticulation system for 700-plot development, establish design criteria and standards for project, conduct water demand analysis and future projections, perform hydraulic modeling and network optimization, prepare detailed technical documentation and drawings, develop specifications and bills of quantities, coordinate with client and relevant authorities.","Major Achievements: Successfully designed water distribution system serving 663 residential plots, 3 school parcels, and multiple recreational and public spaces, completed comprehensive design package including detailed hydraulic models, engineering drawings, technical specifications, and bills of quantities, optimized system design for operational flexibility and reliability through dual-zone approach.","Technical Highlights: - Utilized Bentley WaterGEM® v8i for advanced hydraulic modeling - Designed dual-zone system with interconnection for enhanced reliability - Integrated GIS data for accurate spatial representation and planning - Incorporated fire protection with hydrants at 150-200m intervals - System components: - Two NCWSC service connection points from DN250mm main - Network of uPVC Class C pipes ranging from DN50mm to DN200mm - Total pipeline length: 13,905m - 91 gate valves - 19 fire hydrants","Key Metrics: - Designed water distribution system for 663 residential plots - Completed 13,905m of pipeline design - Incorporated 91 gate valves and 19 fire hydrants","Skills Demonstrated: - Hydraulic modeling and simulation - GIS integration and spatial analysis - Client communication and coordination","Technical Documentation Produced: - Hydraulic modeling reports - GIS maps and spatial data - Client communication logs","Collaborations/Partnerships: - Partnered with NCWSC for service connections - Collaborated with GIS specialists for spatial data integration - Coordinated with fire departments for hydrant placements","Collaborations/Partnerships: - NCWSC for water service integration - GIS specialists for spatial data accuracy - Fire departments for hydrant placement","id: \"e2f3a4b5-c6d7-7890-4567-89abcdef0123\""]}
{"type":"entity","name":"Public Health Engineering Technical-Team Leader (PHE-TTL)","entityType":"Position","observations":["Organization: Oxfam GB","Location: Jordan (Zaatari Refugee Camp)","Duration: March 2014 - April 2016","Project Context: Syrian refugee response","UUID: WASH-14-OXF-TTL-JOR","Context: Syrian refugee response in Jordan, implementing sustainable, household-level water supply and wastewater collection systems in one of the world's largest refugee camps, transitioning from emergency to long-term WASH solutions.","Project Description: Syrian refugee response in Jordan, implementing sustainable, household-level water supply and wastewater collection systems in one of the world's largest refugee camps, transitioning from emergency to long-term WASH solutions.","Key Responsibilities: Lead design and implementation of large-scale water and wastewater networks, prepare proposals and secure funding for long-term WASH infrastructure, manage construction contracts and supervise international consultants and contractors, design and implement water supply infrastructure, plan and execute wastewater collection system, lead hygiene promotion and community mobilization initiatives, implement climate-smart solutions in WASH infrastructure, respond to new refugee influxes with rapid WASH deployment.","Major Achievements: Led implementation of WASH infrastructure serving 100,000 Syrian refugees, secured $16M from UNICEF for long-term WASH infrastructure, increased water availability from 15 L/person/day to 35 L/person/day for 100,000 refugees, led successful cross-border WASH Operations and implemented WASH infrastructure for a 30,000 capacity transition centre.","Technical Highlights: - Designed water supply system for 20 million liters per day capacity - Implemented 37km of solids-free wastewater collection systems (small bore sewers) - Installed solar panels for 30% of pump station energy needs - Implemented WASH facilities at transition centres","Key Metrics: - Implemented WASH infrastructure for 100,000 refugees - Secured $16M in funding for long-term infrastructure - Increased water availability to 35 L/person/day","Skills Demonstrated: - Infrastructure design and implementation - Funding proposal development - Cross-border operations management","Technical Documentation Produced: - Infrastructure design proposals - Funding applications - Cross-border operation plans","Collaborations/Partnerships: - Partnered with UNICEF for funding and support - Collaborated with local NGOs for community engagement - Worked with international consultants for infrastructure design","Collaborations/Partnerships: - UNICEF for funding and strategic support - Local NGOs for community engagement - International consultants for design expertise","id: \"f2a3b4c5-d6e7-8901-5678-9abcdef01234\""]}
{"type":"entity","name":"WASH Delegate","entityType":"Position","observations":["Organization: Canadian Red Cross","Location: Various International Missions","Duration: September 2021 - Present","Project Context: Surge support for National Societies","UUID: WASH-21-CRC-DEL-VAR","Context: Providing surge support for National Societies, IFRC rapid response management systems, and ICRC in various emergency contexts, requiring adaptability to different cultural and operational environments.","Project Description: Providing surge support for National Societies, IFRC rapid response management systems, and ICRC in various emergency contexts, requiring adaptability to different cultural and operational environments.","Key Responsibilities: Provide surge support for water and sanitation programs during emergencies, support National Society Development initiatives using core RCRC strategies, liaise with WASH-supported activities and team members for analysis and reporting, mentor and train with Canadian Red Cross Emergency Response Units, develop and implement WASH strategies for emergency operations.","Major Achievements: Facilitated sustainable WASH strategies for 5+ National Society partners, impacting 1 million+ beneficiaries, trained 50+ WASH practitioners in rapid assessment, project design, and implementation techniques, designed and oversaw implementation of water supply systems with capacities ranging from 150 m³/day to 2,000 m³/day.","Technical Highlights: - Implemented solar-powered water supply systems, reducing operational costs by up to 60% - Designed emergency sanitation solutions adaptable to various geographical contexts - Developed rapid deployment kits for water quality testing in emergency settings","Technical Highlights: - Constructed 6 boreholes with solar-powered submersible pumps, each producing 40-60 m³/day - Installed 4 elevated water towers (5m high) with 10,000L capacity each - Implemented 400 household rainwater harvesting systems (2000L capacity each)","Key Metrics: - Impacted 1 million+ beneficiaries through WASH strategies - Trained 50+ WASH practitioners - Designed water systems with capacities up to 2,000 m³/day","Key Metrics: - Constructed 6 boreholes producing 40-60 m³/day - Installed 4 water towers with 10,000L capacity each - Implemented 400 rainwater harvesting systems","Skills Demonstrated: - Emergency response and management - Training and capacity building - Water quality testing and analysis","Skills Demonstrated: - Borehole construction and management - Water tower installation - Rainwater harvesting system setup","Technical Documentation Produced: - Emergency response plans - Training manuals - Water quality analysis reports","Technical Documentation Produced: - Borehole construction and management guides - Water tower installation manuals - Rainwater harvesting system setup instructions","Collaborations/Partnerships: - Partnered with National Societies for WASH programs - Collaborated with IFRC for rapid response initiatives - Worked with local health departments for hygiene promotion","Collaborations/Partnerships: - Partnered with IFRC for borehole construction - Collaborated with local communities for water tower installation - Worked with international donors for funding","Collaborations/Partnerships: - National Societies for program implementation - IFRC for emergency response coordination - Local health departments for hygiene initiatives","Collaborations/Partnerships: - IFRC for borehole construction - Local communities for water tower installation - International donors for funding","id: \"a3b4c5d6-e7f8-9012-6789-abcdef012345\""]}
{"type":"entity","name":"Public Health Engineering - Team Leader (PHE-TL)","entityType":"Position","observations":["Organization: Oxfam GB","Location: South Sudan (Maban County)","Duration: March 2013 - February 2014","Project Context: Maban Emergency response","UUID: WASH-13-OXF-TL-SSD","Context: Maban Emergency response, focusing on Kaya Refugee Camp in Upper Nile state of South Sudan. The project addressed urgent WASH needs for a rapidly growing refugee population fleeing conflict, in a challenging and resource-constrained environment.","Project Description: Maban Emergency response, focusing on Kaya Refugee Camp in Upper Nile state of South Sudan. The project addressed urgent WASH needs for a rapidly growing refugee population fleeing conflict, in a challenging and resource-constrained environment.","Key Responsibilities: Implement water supply and sanitation systems for IDPs in Kaya Refugee Camp, design and oversee construction of water supply infrastructure, plan and implement sanitation facilities including shared latrines, support community-led total sanitation programs, manage WASH budget and ensure donor compliance, coordinate with other sectors and agencies, lead capacity building initiatives for national staff.","Major Achievements: Improved access to safe water and sanitation for 45,000 IDPs, reaching a coverage rate of 80%, increased water availability from 7 L/person/day to 22 L/person/day, achieved 95% latrine coverage (household and institutional) within 9 months.","Technical Highlights: - Designed system with 6 boreholes, total water production capacity of 800 m³/day - Implemented solar pumping system, reducing fuel consumption by 70% - Constructed 1500 shared family latrines using primarily local materials","Key Metrics: - Improved water access for 45,000 IDPs - Achieved 95% latrine coverage within 9 months - Increased water availability to 22 L/person/day","Skills Demonstrated: - Water supply and sanitation system design - Solar energy integration - Community engagement and mobilization","Technical Documentation Produced: - Water supply system designs - Solar energy integration plans - Community mobilization strategies","Collaborations/Partnerships: - Partnered with Oxfam GB for emergency response - Collaborated with local communities for project implementation - Worked with solar energy providers for system integration","Collaborations/Partnerships: - Oxfam GB for emergency response efforts - Local communities for project execution - Solar energy providers for system integration","id: \"b3c4d5e6-f8a9-0123-7890-bcdef0123456\""]}
{"type":"entity","name":"Project Manager","entityType":"Position","observations":["Organization: GIBB Africa","Location: Dadaab, Kenya","Duration: October 2010 - February 2011","Project Context: Emergency Drought Response","UUID: WASH-10-GIBB-PM-KEN","Context: Emergency Drought Response in Dadaab, specifically for the IFO 2 Refugee Camp, addressing water supply needs for 40,000 beneficiaries in a rapidly expanding refugee complex.","Project Description: Emergency Drought Response in Dadaab, specifically for the IFO 2 Refugee Camp, addressing water supply needs for 40,000 beneficiaries in a rapidly expanding refugee complex.","Key Responsibilities: Manage client liaison and coordination of consultants' services, establish design standards and criteria for water supply system, lead detailed design of main transmission pipeline and distribution network, perform Water Distribution modeling using WaterCAD, supervise topographical surveys for pipeline alignment, prepare detailed BoQs and technical specifications, conduct engineering cost-benefit analysis of distribution options, provide technical assistance to implementing partners during construction.","Key Responsibilities: Lead detailed design of water distribution systems for refugee camps, manage client liaison and coordination of consultants' services, conduct partner and community consultations on service levels, establish project design standards and criteria, oversee topographical surveys and technical assessments, perform complex water distribution modeling, prepare detailed BoQs, specifications, and technical drawings, conduct cost-benefit analysis of water distribution options.","Context: Emergency Drought Response in Dadaab, focusing on IFO 3 and Kambioos Refugee Camps, addressing water supply needs of drought-affected populations in one of the world's largest refugee complexes.","Project Description: Emergency Drought Response in Dadaab, focusing on IFO 3 and Kambioos Refugee Camps, addressing water supply needs of drought-affected populations in one of the world's largest refugee complexes.","Major Achievements: Designed comprehensive water supply system for 40,000 refugees, completed detailed design of 3.8km transmission pipeline and 57km distribution network, optimized system design to meet SPHERE standards while minimizing operational costs.","Major Achievements: Developed comprehensive water supply designs for camps hosting 150,000 refugees, successfully integrated SPHERE guidelines into design standards, completed detailed designs for 8.4km of DN250mm main transmission pipeline and 64km of distribution network.","Technical Highlights: - Utilized Bentley WaterCAD v8i for advanced hydraulic modeling - Designed system to meet projected demand of 3,000 m³/day for IFO 3 and 4,500 m³/day for Kambioos - Incorporated climate-resilient features in system design","Key Metrics: - Designed water supply system for 40,000 refugees - Completed 3.8km transmission pipeline and 57km distribution network - Optimized system design to meet SPHERE standards","Skills Demonstrated: - Advanced hydraulic modeling - Climate-resilient design - Stakeholder consultation and engagement","Technical Documentation Produced: - Hydraulic modeling simulations - Climate-resilient design guidelines - Stakeholder consultation records","Collaborations/Partnerships: - Partnered with GIBB Africa for design and implementation - Collaborated with local government for project approvals - Worked with international donors for funding","Collaborations/Partnerships: - GIBB Africa for design and project management - Local government for regulatory approvals - International donors for financial support","id: \"c3d4e5f6-a9b0-1234-8901-cdef01234567\""]}
{"type":"entity","name":"Sanitation Expert (Hydraulics)","entityType":"Position","observations":["Organization: COWI A/S","Location: Kenya","Duration: September 2016 - January 2018","Project Context: 25-year sanitation masterplan for Nairobi","UUID: WASH-16-COWI-EXP-KEN","Context: Development of a 25-year sanitation masterplan for Nairobi City and Selected Satellite Towns, addressing rapid urbanization, informal settlement growth, and environmental challenges in a major East African metropolis.","Project Description: Development of a 25-year sanitation masterplan for Nairobi City and Selected Satellite Towns, addressing rapid urbanization, informal settlement growth, and environmental challenges in a major East African metropolis.","Key Responsibilities: Formulate long-term sanitation master plan for Nairobi and satellite towns, lead field assessments and data analysis for infrastructure investment planning, model conventional and simplified sewer collection systems, conduct advanced hydraulic modeling using specialized software, prepare actionable recommendations for urgent system upgrades, develop sanitation strategies for informal settlements, update and expand GIS database for water and sanitation infrastructure, establish project design standards and criteria.","Major Achievements: Developed a 25-year Hydraulic Masterplan benefiting over 5 million current residents, expandable to 8.5 million by 2040, led development of a phased $50M infrastructure investment plan, modeled over 500km of existing and proposed sewer networks.","Technical Highlights: - Used advanced modeling software (SewerGEMS, SWMM) for system analysis - Designed decentralized treatment systems for 20 informal settlements (50,000 residents each) - Created a digital elevation model with 1m contour accuracy for the entire 3000 km² study area","Key Metrics: - Developed masterplan benefiting 5 million residents - Modeled over 500km of sewer networks - Led $50M infrastructure investment plan","Skills Demonstrated: - Sewer system modeling and design - Decentralized treatment solutions - Digital elevation modeling","Technical Documentation Produced: - Sewer system design documents - Decentralized treatment solution plans - Digital elevation models","Collaborations/Partnerships: - Partnered with COWI A/S for masterplan development - Collaborated with local municipalities for sewer system design - Worked with environmental agencies for compliance","Collaborations/Partnerships: - COWI A/S for masterplan development - Local municipalities for sewer system design - Environmental agencies for compliance","id: \"d3e4f5a6-b0c1-2345-9012-def012345678\""]}
{"type":"entity","name":"WASH Coordinator","entityType":"Position","observations":["Organization: International Medical Corps (IMC)","Location: Ecuador","Duration: May 2016 - July 2016","Project Context: Post-Earthquake Emergency Response","UUID: WASH-16-IMC-COORD-ECU","Context: Post-Earthquake Emergency Response following a 7.8 magnitude earthquake, addressing immediate WASH needs in a challenging post-disaster environment with a focus on rapid, efficient deployment of resources.","Project Description: Post-Earthquake Emergency Response following a 7.8 magnitude earthquake, addressing immediate WASH needs in a challenging post-disaster environment with a focus on rapid, efficient deployment of resources.","Key Responsibilities: Scale emergency response for water, sanitation, and hygiene needs, conduct rapid needs assessments in affected communities, coordinate water, sanitation, and hygiene kit distribution, implement emergency water supply interventions, oversee emergency sanitation response, coordinate hygiene promotion activities, ensure environmental compliance and climate adaptive approaches, liaise with local government, military, and humanitarian partners, train and mentor national and expatriate WASH staff.","Major Achievements: Provided immediate access to safe water for 15,000 earthquake-affected people within 3 weeks of deployment, increased water availability from 2 L/person/day to 15 L/person/day in target areas, achieved 90% coverage of basic sanitation facilities in managed displacement camps.","Technical Highlights: - Set up 3 mobile water treatment units, each producing 5,000 L/day of potable water - Implemented eco-friendly disposal methods for 15 tons of earthquake debris - Designed rainwater harvesting systems for 10 temporary schools","Technical Highlights: - Implemented 3 solar-powered water systems, each producing 60 m³/day - Designed and constructed 500 emergency latrines achieving 1:50 people ratio - Initiated voucher programs for hygiene items, benefiting 5,000 households","Key Metrics: - Provided safe water for 15,000 people within 3 weeks - Increased water availability to 15 L/person/day - Achieved 90% sanitation facility coverage","Key Metrics: - Implemented 3 solar-powered systems producing 60 m³/day - Constructed 500 emergency latrines - Benefited 5,000 households through voucher programs","Skills Demonstrated: - Mobile water treatment unit setup - Eco-friendly waste disposal - Rainwater harvesting system design","Skills Demonstrated: - Solar-powered system implementation - Emergency latrine construction - Hygiene item distribution","Technical Documentation Produced: - Mobile water treatment unit manuals - Eco-friendly waste disposal guidelines - Rainwater harvesting system designs","Technical Documentation Produced: - Solar-powered system implementation guides - Emergency latrine construction manuals - Hygiene item distribution plans","Collaborations/Partnerships: - Partnered with IMC for emergency response - Collaborated with local NGOs for community outreach - Worked with government agencies for resource allocation","Collaborations/Partnerships: - Partnered with IMC for solar-powered system implementation - Collaborated with local NGOs for hygiene promotion - Worked with government agencies for resource allocation","Collaborations/Partnerships: - IMC for emergency response initiatives - Local NGOs for community outreach - Government agencies for resource allocation","Collaborations/Partnerships: - IMC for solar-powered system implementation - Local NGOs for hygiene promotion - Government agencies for resource allocation","id: \"e3f4a5b6-c1d2-3456-0123-ef0123456789\""]}
{"type":"entity","name":"WASH Project Officer","entityType":"Position","observations":["Organization: International Organization for Migration (IOM)","Location: Darfur, Sudan","Duration: February 2024 - June 2024","Project Context: Addressing critical WASH needs amidst humanitarian crisis","UUID: WASH-24-IOM-PO-SUD","Context: Ongoing conflict in Sudan resulted in displacement of over 6.8 million people within Sudan and 2.1 million cross-border movements. The project addressed critical WASH needs amidst a complex humanitarian crisis.","Project Description: Ongoing conflict in Sudan resulted in displacement of over 6.8 million people within Sudan and 2.1 million cross-border movements. The project addressed critical WASH needs amidst a complex humanitarian crisis.","Key Responsibilities: Lead development of multi-year WASH strategy for conflict-affected populations, collaborate on technical reviews of subgrantee proposals for RRF funding, steer Technical Working Group for Sudan Country WASH sector Needs Assessment and Analysis Strategy, key member in Sudan Risks and Hazards Contingency Planning for conflict and displacement preparedness, develop Concept Notes and funding proposals for countrywide WASH interventions, support coordination and representation of IOM in WASH coordination forums, prepare WASH progress reports and provide regular updates on active areas of responsibility.","Major Achievements: Provided technical project support for sustaining access to WASH services in Darfur states targeting some 2.2 million conflict-affected IDPs, evaluated RRF funding proposals worth up to $500,000 each, ensuring strategic alignment and feasibility, coordinated input from 15+ sector partners for country-wide WASH Needs Assessment Strategy.","Technical Highlights: - Designed water supply strategies targeting 35 L/person/day in line with SPHERE standards - Planned sanitation interventions aiming for 1 latrine per 20 people in emergency settings - Incorporated climate-resilient WASH solutions in long-term strategy development","Key Metrics: - Supported WASH services for 2.2 million IDPs - Evaluated RRF proposals worth up to $500,000 each - Coordinated input from 15+ sector partners","Skills Demonstrated: - Strategic planning and development - Proposal evaluation and review - Sector coordination and representation","Technical Documentation Produced: - Strategic planning documents - Proposal evaluation reports - Sector coordination meeting minutes","Collaborations/Partnerships: - Partnered with IOM for WASH strategy development - Collaborated with local partners for project implementation - Worked with international donors for funding proposals","Collaborations/Partnerships: - IOM for strategic development - Local partners for project implementation - International donors for funding proposals","id: \"f3a4b5c6-d2e3-4567-1234-f0123456789a\""]}
{"type":"entity","name":"WASH Specialist","entityType":"Position","observations":["Organization: Norwegian Refugee Council (NRC)","Location: Kenya & Tanzania","Duration: August 2021 - August 2022","Project Context: Sustaining WASH, Education, ICLA, and LFS response","UUID: WASH-21-NRC-SPEC-KEN","Context: Sustaining WASH, Education, ICLA and LFS response for displaced populations in refugee camps in Kenya (Kakuma, Dadaab) and Tanzania (Nyarugusu, Nduta, Mtendeli), targeting a total of 527,000 Persons of Concern.","Project Description: Sustaining WASH, Education, ICLA and LFS response for displaced populations in refugee camps in Kenya (Kakuma, Dadaab) and Tanzania (Nyarugusu, Nduta, Mtendeli), targeting a total of 527,000 Persons of Concern.","Key Responsibilities: Develop WASH strategies and technical Standard Operating Procedures (SOPs), lead fundraising efforts and develop funding proposals, design and implement integrated Water, Sanitation, and Shelter Services, supervise compliance with donor and supplier commitments, initiate systems-strengthening and climate-resilient approaches, provide technical direction for cash-based and market-based programs, facilitate training and capacity building for technical staff, liaise with MEL teams for program monitoring and evaluation.","Major Achievements: Developed and implemented WASH strategies benefiting 527,000 refugees and asylum seekers, secured USD 23.8 million in funding for annual WASH and integrated programs, improved water access for 300,000+ beneficiaries, increasing average consumption from 15 to 22 L/person/day.","Technical Highlights: - Designed solar-powered water systems for 5 boreholes, reducing operating costs by 60% - Implemented rainwater harvesting systems for 50 institutions, capturing 500 m³ per rainy season - Developed voucher systems for hygiene items reaching 50,000 households","Key Metrics: - Benefited 527,000 refugees through WASH strategies - Secured $23.8M in funding for programs - Improved water access for 300,000+ beneficiaries","Skills Demonstrated: - Solar-powered water system design - Rainwater harvesting implementation - Voucher system development","Technical Documentation Produced: - Solar-powered water system designs - Rainwater harvesting implementation plans - Voucher system development guides","Collaborations/Partnerships: - Partnered with NRC for refugee support - Collaborated with local communities for program delivery - Worked with international organizations for funding","Collaborations/Partnerships: - NRC for refugee support programs - Local communities for program delivery - International organizations for funding","id: \"a4b5c6d7-e3f4-5678-2345-0123456789ab\""]}
{"type":"entity","name":"WASH Consultant","entityType":"Position","observations":["Organization: Oxfam GB","Location: Dolo-Ado, Ethiopia","Duration: July 2012 - March 2013","Project Context: Emergency response to drought-affected Somali refugees","UUID: WASH-12-OXF-CONS-ETH","Context: Emergency response to drought-affected Somali refugees in Heloweyn Refugee Camp, Ethiopia. Project focused on rapid assessment, strategy development, and implementation of water supply schemes in a challenging humanitarian context.","Project Description: Emergency response to drought-affected Somali refugees in Heloweyn Refugee Camp, Ethiopia. Project focused on rapid assessment, strategy development, and implementation of water supply schemes in a challenging humanitarian context.","Key Responsibilities: Conduct comprehensive field assessments for WASH needs, develop strategy for water supply scheme implementation, liaise with local authorities, WASH actors, Government, and UNHCR, establish project design standards and criteria, design and oversee rehabilitation of water supply systems, plan and implement water distribution networks, prepare technical specifications and bills of quantities, conduct training for partner staff on water supply and distribution modeling.","Major Achievements: Developed and implemented water supply strategy for 45,000 drought-affected Somali refugees and host community members, completed initial assessment and 6-month implementation strategy within 3 weeks of deployment, designed and oversaw implementation of water supply system increasing access from <5 L/person/day to >20 L/person/day.","Technical Highlights: - Designed river abstraction system with jet-wells, capacity 120 m³/hour - Implemented water treatment system including roughing filters (40 m³/hour) and slow sand filters (80 m³/hour) - Planned and designed 12.4 km transmission line (DN250mm HDPE) and 67 km distribution network","Key Metrics: - Developed water supply strategy for 45,000 refugees - Completed 6-month implementation strategy in 3 weeks - Increased water access to >20 L/person/day","Skills Demonstrated: - River abstraction system design - Water treatment process implementation - Transmission line planning","Technical Documentation Produced: - River abstraction system designs - Water treatment process implementation guides - Transmission line planning documents","Collaborations/Partnerships: - Partnered with Oxfam GB for drought response - Collaborated with local authorities for project approvals - Worked with UNHCR for refugee support","Collaborations/Partnerships: - Oxfam GB for drought response - Local authorities for project approvals - UNHCR for refugee support","id: \"b4c5d6e7-f4a5-6789-3456-123456789abc\""]}
{"type":"entity","name":"Graduate Engineer","entityType":"Position","observations":["Organization: GIBB Africa","Location: Various (Kenya, Tanzania, Rwanda)","Duration: 2009 - 2012","Project Context: Water supply, sanitation, and urban development projects","UUID: WASH-09-GIBB-ENG-VAR","Key Responsibilities: Assist in design and implementation of water supply and sanitation projects, conduct field assessments and data collection for project planning, perform engineering calculations and prepare design drawings, develop cost estimates and bills of quantities, supervise construction works as Resident Engineer, prepare technical reports and contribute to tender documentation, liaise with clients, contractors, and other stakeholders.","Context: Involved in multiple water supply, sanitation, and urban development projects across East Africa, ranging from large-scale urban water systems to specialized infrastructure for new developments.","Project Description: Involved in multiple water supply, sanitation, and urban development projects across East Africa, ranging from large-scale urban water systems to specialized infrastructure for new developments.","Major Achievements: Contributed to design of water supply works for Maswa, Kahama, and Ushirombo Towns in Tanzania, supervised construction of 4,800 customer water connections in Shinyanga and Kahama, Tanzania, participated in development of water and sanitation masterplan for Tatu City Project, Kenya (1,200 hectares).","Technical Highlights: - Utilized AutoCAD and Civil 3D for engineering drawings and designs - Conducted hydraulic modeling for water distribution systems - Designed rainwater harvesting and wastewater recycling systems for Langata Business Park, Kenya","Key Metrics: - Designed water systems for 3 urban areas - Supervised 4,800 customer water connections - Contributed to masterplan for 1,200-hectare project","Skills Demonstrated: - AutoCAD and Civil 3D proficiency - Hydraulic modeling expertise - Rainwater harvesting design","Technical Documentation Produced: - AutoCAD and Civil 3D drawings - Hydraulic modeling reports - Rainwater harvesting design documents","Collaborations/Partnerships: - Partnered with GIBB Africa for engineering projects - Collaborated with local authorities for project approvals - Worked with contractors for construction supervision","Collaborations/Partnerships: - Local water authorities in Kenya and Tanzania - International development agencies (World Bank, AfDB) - Private developers (e.g., Tatu City Ltd) - Environmental consulting firms","id: \"c4d5e6f7-a5b6-7890-4567-23456789abcd\""]}
{"type":"entity","name":"Tomas Lopez de Bufala","entityType":"Reference","observations":["Title: Chief of WASH","Organization: UNICEF, Ukraine","Telephone: 0038 050 356 2997","Email: tomaslopezdebufala@gmail.com","Skype: TOMASL.UNOPS","Interactions: Counterpart Personnel","Period: 2014-2016"]}
{"type":"entity","name":"Qasim Barech","entityType":"Reference","observations":["Title: Head of Operation","Organization: NRC, Afghanistan","Telephone: +923009816078","Email: Qasim barech@gmail.com","Skype: qasimbarech","Interactions: Colleague, Direct Line Manager","Period: 2014-2016"]}
{"type":"entity","name":"Eng. David Kimingi","entityType":"Reference","observations":["Title: Operational Manager","Organization: Gibb Africa Ltd","Telephone: (+254) 722 253808","Email: Kimingid@yahoo.com","Skype: david.kimingi","Interactions: Direct Line Manager","Period: 2010-2012"]}
{"type":"entity","name":"Eng. Reuben Onunga","entityType":"Reference","observations":["Title: Deputy Team Leader","Organization: COWI A/S, Kenya","Telephone: +(254) 721560506","Email: Onungajuma@gmail.com","Skype: REUBEN.JUMA","Interactions: Direct Line Manager","Period: 2016-2017"]}
{"type":"entity","name":"Eng. Jackson Nzaiga","entityType":"Reference","observations":["Title: Director","Organization: Losai Management Ltd","Telephone: (+254) 700 128157","Email: jnzainga@losaimanagement.com","Skype: LIVE:JNZAINGA","Interactions: Employer (Private Jobs)","Period: 2010-2024"]}
{"type":"entity","name":"Dr. Billy Joseph","entityType":"Reference","observations":["Title: Programme Manager","Organization: International Medical Corps, Nigeria","Telephone: +(232) 79 423686","Email: bijokut@gmail.com","Skype: BIJOKUT7","Interactions: Direct Line Manager","Period: 2017-2020"]}
{"type":"entity","name":"Enamul Hoque","entityType":"Reference","observations":["Title: Humanitarian Support Personnel","Organization: OXFAM, UK","Telephone: (+880) 1755-528646","Email: ehoque@ght.oxfam.org","Skype: ENAMUL.HOQUE62","Interactions: Matrix Manager (2013-2014)","Period: 2013-2014"]}
{"type":"entity","name":"Vincent Ogira","entityType":"Reference","observations":["Title: Humanitarian Support Personnel","Organization: OXFAM, UK","Telephone: (+254) 721 558902","Email: Ogiraotieno@gmail.com","Skype: V.OGIRA","Interactions: Counterpart Personnel","Period: 2010-201"]}
{"type":"entity","name":"Martin de Vries","entityType":"Reference","observations":["Title: Senior Manager, Shelter, Construction, Engineering and WASH Emergency Management – Canada & International (EMCI)","Organization: Canadian Red Cross","Email: Martin.deVries@redcross.ca","Skype: mdevries@redcross.ca","Interactions: Deployment Manager","Period: 2021-Present"]}
{"type":"entity","name":"Patrick Mutonga","entityType":"Reference","observations":["Title: Project Manager (WASH and Basic Infrastructure)","Organization: IOM, Sudan","Email: Pmutonga@IoM.int","Skype: Pmutonga","Interactions: Direct Line Manager","Period: 2024"]}
{"type":"entity","name":"Palladium International","entityType":"Organisation","observations":["Implemented by The Palladium Group, The Humanitarian and Stabilization Operations Team (HSOT) provides the Foreign, Commonwealth and Development Office (FCDO) with additional capacity and specialist expertise to support effective UK response to sudden-onset disasters, protracted crises and complex emergencies.","HSOT is a team of over 80 core staff based in London and have a wide range of experts on their humanitarian and stabilisation rosters that can rapidly deploy if needed. Operational partner, Palladium, manage HSOT which is embedded in FCDO.","id: \"e4f5a6b7-c8d9-1234-ef56-7890abcdef01\""]}
{"type":"entity","name":"HSOT Humanitarian Adviser-Palladium International","entityType":"Role Opening","observations":["Job Dimensions:\n\n- **Job Purpose**:\n  - Provide specialist humanitarian advice, analysis, and support to UK Government officials.\n  - Aid in humanitarian preparedness and response, including strategy development, programme implementation, and policy engagement.\n  - Contribute to efficient and effective UK humanitarian responses appropriate to the needs of affected communities.\n- **Responsibilities**:\n  - **Programme Support**:\n    - Assist FCDO colleagues in designing and mobilizing humanitarian programmes.\n    - Ensure programmes are evidence-based and align with FCDO policy priorities and best practices.\n    - Advise on robust Monitoring, Evaluation, and Learning (MEL) processes.\n    - Provide feedback on implementing partners' performance and support necessary adjustments.\n  - **External Engagement**:\n    - Facilitate effective coordination with host governments, humanitarian agencies, and other donors.\n    - Offer specialist sectoral support and analysis across areas such as Shelter, Water, Sanitation, and Hygiene (WASH), Health and Nutrition, Protection, and Education.\n    - Advise on humanitarian advocacy messages and UK diplomatic engagement opportunities.\n  - **Internal Coordination**:\n    - Ensure effective collaboration with HSOT and FCDO stakeholders.\n    - Contribute to FCDO policy briefs, communication materials, and reporting.\n    - Support internal learning and development processes.\n  - **Humanitarian Information and Analysis**:\n    - Provide support in humanitarian information management and analysis.\n    - Monitor contexts and responses, offering insights on potential trajectories.\n    - Engage in horizon-scanning and contingency planning.\n  - **Rapid-Onset Response**:\n    - Rapidly assess crisis situations in collaboration with HSOT and FCDO teams.\n    - Develop initial response options based on needs, gaps, funding, capabilities, and access.\n    - Conduct field monitoring or establish appropriate monitoring mechanisms.\n    - Review response plans and project proposals to inform FCDO decision-making.\n  - **Compliance and Safeguarding**:\n    - Comply with and promote safeguarding minimum operating standards.\n    - Adhere to legal, regulatory, and security requirements in service delivery.\n- **Knowledge and Experience**:\n  - Extensive field experience in senior leadership roles within humanitarian agencies.\n  - In-depth knowledge of humanitarian theory, practice, and architecture.\n  - Proven expertise in designing and managing humanitarian programmes.\n  - Ability to manage a varied and rapidly changing workload effectively.\n  - Willingness and capability to deploy in support of FCDO’s operations.\n- **Technical Skills**:\n  - Excellent written and oral communication skills.\n  - Strong analytical abilities with proficiency in Microsoft Excel.\n  - Capacity to simplify complex issues and convey messages persuasively.\n  - Exceptional networking skills and ability to foster strong relationships.\n  - Proficient in coordinating with diverse stakeholders, including governments and agencies.\n  - **Language Proficiency**:\n    - C2 fluency in English (required).\n    - Working proficiency (B2+) in another relevant language (desirable).\n  - Conscientious in meeting commitments, observing deadlines, and achieving results.\n- **Key Qualifications**:\n  - Significant experience in senior leadership positions within humanitarian contexts.\n  - Expertise in humanitarian programme design and operational management.\n  - Demonstrable knowledge of humanitarian principles and organizational frameworks.\n  - Fluency in English (C2 level); additional languages advantageous.\n  - Proven ability to handle demanding workloads and prioritize effectively.\n- **Minimum Requirements**:\n  - **Security Clearance Eligibility**:\n    - Must be eligible for UK security clearance.\n    - Must have resided in the UK for a minimum of 2 out of the last 5 years, including 12 months continuous residency.\n  - **Availability and Commitment**:\n    - Willingness and ability to deploy to support FCDO’s humanitarian initiatives.\n    - Alignment with FCDO’s humanitarian policies and UK priorities.\n  - **Legal and Ethical Compliance**:\n    - Commitment to comply with all legal, regulatory, and security requirements.\n    - Adherence to safeguarding standards and promotion of safe practices.\n- **Core Competencies**:\n  - **Seeing the Big Picture**:\n    - Understand broader economic, social, political, and environmental contexts to inform strategies and policies.\n  - **Communicating and Influencing**:\n    - Communicate clearly and effectively to diverse audiences.\n    - Simplify complex information and persuade stakeholders towards common goals.\n  - **Working Together**:\n    - Build strong networks, foster inclusive environments, and prioritize team well-being.\n  - **Delivering at Pace**:\n    - Clarify roles and responsibilities, meet deadlines, and maintain performance under pressure.\n\nRole Synopsis:\n\nJoin Palladium International's HSOT Humanitarian Adviser Roster to make a meaningful impact in global humanitarian efforts. Your expertise can contribute to effective and responsive aid strategies that support communities in need.","**Job Dimensions:**\n\n1. **Job Purpose**\n   - Provide specialist humanitarian advice, analysis, and support to UK Government officials.\n   - Aid in humanitarian preparedness and response, including strategy development, programme implementation, and policy engagement.\n   - Contribute to efficient and effective UK humanitarian responses appropriate to the needs of affected communities.\n\n2. **Responsibilities**\n   - **Programme Support**\n     - Assist FCDO colleagues in designing and mobilizing humanitarian programmes.\n     - Ensure programmes are evidence-based and align with FCDO policy priorities and best practices.\n     - Advise on robust Monitoring, Evaluation, and Learning (MEL) processes.\n     - Provide feedback on implementing partners' performance and support necessary adjustments.\n   - **External Engagement**\n     - Facilitate effective coordination with host governments, humanitarian agencies, and other donors.\n     - Offer specialist sectoral support and analysis across areas such as Shelter, Water, Sanitation, and Hygiene (WASH), Health and Nutrition, Protection, and Education.\n     - Advise on humanitarian advocacy messages and UK diplomatic engagement opportunities.\n   - **Internal Coordination**\n     - Ensure effective collaboration with HSOT and FCDO stakeholders.\n     - Contribute to FCDO policy briefs, communication materials, and reporting.\n     - Support internal learning and development processes.\n   - **Humanitarian Information and Analysis**\n     - Provide support in humanitarian information management and analysis.\n     - Monitor contexts and responses, offering insights on potential trajectories.\n     - Engage in horizon-scanning and contingency planning.\n   - **Rapid-Onset Response**\n     - Rapidly assess crisis situations in collaboration with HSOT and FCDO teams.\n     - Develop initial response options based on needs, gaps, funding, capabilities, and access.\n     - Conduct field monitoring or establish appropriate monitoring mechanisms.\n     - Review response plans and project proposals to inform FCDO decision-making.\n   - **Compliance and Safeguarding**\n     - Comply with and promote safeguarding minimum operating standards.\n     - Adhere to legal, regulatory, and security requirements in service delivery.\n\n3. **Knowledge and Experience**\n   - Extensive field experience in senior leadership roles within humanitarian agencies.\n   - In-depth knowledge of humanitarian theory, practice, and architecture.\n   - Proven expertise in designing and managing humanitarian programmes.\n   - Ability to manage a varied and rapidly changing workload effectively.\n   - Willingness and capability to deploy in support of FCDO’s operations.\n\n4. **Technical Skills**\n   - Excellent written and oral communication skills.\n   - Strong analytical abilities with proficiency in Microsoft Excel.\n   - Capacity to simplify complex issues and convey messages persuasively.\n   - Exceptional networking skills and ability to foster strong relationships.\n   - Proficient in coordinating with diverse stakeholders, including governments and agencies.\n\n5. **Language Proficiency**\n   - C2 fluency in English (required).\n   - Working proficiency (B2+) in another relevant language (desirable).\n\n6. **Organizational Skills**\n   - Conscientious in meeting commitments, observing deadlines, and achieving results.\n\n7. **Key Qualifications**\n   - Significant experience in senior leadership positions within humanitarian contexts.\n   - Expertise in humanitarian programme design and operational management.\n   - Demonstrable knowledge of humanitarian principles and organizational frameworks.\n   - Fluency in English (C2 level); additional languages advantageous.\n   - Proven ability to handle demanding workloads and prioritize effectively.\n\n8. **Minimum Requirements**\n   - **Security Clearance Eligibility**\n     - Must be eligible for UK security clearance.\n     - Must have resided in the UK for a minimum of 2 out of the last 5 years, including 12 months continuous residency.\n   - **Availability and Commitment**\n     - Willingness and ability to deploy to support FCDO’s humanitarian initiatives.\n     - Alignment with FCDO’s humanitarian policies and UK priorities.\n   - **Legal and Ethical Compliance**\n     - Commitment to comply with all legal, regulatory, and security requirements.\n     - Adherence to safeguarding standards and promotion of safe practices.\n\n9. **Core Competencies**\n   - **Seeing the Big Picture**\n     - Understand broader economic, social, political, and environmental contexts to inform strategies and policies.\n   - **Communicating and Influencing**\n     - Communicate clearly and effectively to diverse audiences.\n     - Simplify complex information and persuade stakeholders towards common goals.\n   - **Working Together**\n     - Build strong networks, foster inclusive environments, and prioritize team well-being.\n   - **Delivering at Pace**\n     - Clarify roles and responsibilities, meet deadlines, and maintain performance under pressure.\n\n**Role Synopsis:**\n\nJoin Palladium International's HSOT Humanitarian Adviser Roster to make a meaningful impact in global humanitarian efforts. Your expertise can contribute to effective and responsive aid strategies that support communities in need.","id: \"f4a5b6c7-d8e9-2345-f678-890abcdef012\""]}
{"type":"entity","name":"International Rescue Committee","entityType":"Organisation","observations":["The International Rescue Committee (IRC) responds to the world's worst humanitarian crises, helping to restore health, safety, education, economic wellbeing, and power to people devastated by conflict and disaster.","Founded in 1933 at the call of Albert Einstein, the IRC is one of the world's largest international humanitarian non-governmental organizations (INGO), operating in more than 40 countries and 29 U.S. cities.","The IRC is scaling up programming in the West Bank and Gaza, working closely with partners and implementing directly in health and nutrition, protection, WASH, early childhood development, food security, and cash programming to meet critical humanitarian needs.","Headquartered in New York City, USA.","Vision: A world where everyone can achieve their full potential regardless of their circumstances, grounded in humanitarian principles, integrity, accountability, and partnership with local organizations.","Thematic Areas: Responding to crises, healing the sick, rebuilding communities, protecting and empowering women and girls, taking care of children and reuniting families.","Operational Status: Works through Crisis Response, Recovery, and Development (CRRD) programs, and Resettlement, Asylum, and Integration (RAI) efforts.","Culture: Known for humanitarianism, integrity, accountability, and partnership with local organizations.","Current General Needs: Facing challenges due to climate change, armed conflicts, and reduced international support; emphasizes the need for global and local solutions.","**Hiring Trends**","**Recruitment Methods**:","- The IRC partners with **1,000 employers** in **26 cities** to help **9,000 New Americans** find jobs, addressing labor shortages in critical industries.","- Provides culturally and linguistically accessible job training programs for nearly **100 nationalities**, enabling vulnerable populations to build sustainable careers.","**Candidate Selection Processes**:","- Uses an annual emergency watchlist to identify regions with the greatest humanitarian needs, informing recruitment strategies for high-risk areas.","- Builds a diverse workforce to address **7.3 million unfilled jobs** in the U.S., particularly in healthcare and transportation/logistics sectors.","**Notable Patterns in Hiring**:","- Equips New Americans for careers in high-demand industries:","  - **Healthcare Sector**: Needs over **1 million new home health aides and personal-care assistants** by 2026.","  - **Transportation and Logistics**: Anticipated addition of nearly **700,000 new jobs** between 2016 and 2026.","- Mitigates labor shortages, revitalizes communities, and ensures continuity of essential services.","- Prioritizes inclusivity to build a diverse workforce contributing to economic prosperity.","**Additional Insights**:","- Faces challenges predicting humanitarian emergencies but maintains an **85-95% accuracy** over the past decade, bolstering recruitment efforts.","- Provides career development resources, training, and support to employees for continuous growth within the organization.","**Conclusion**:","- IRC's hiring practices focus on strategic partnerships, diversity, and inclusive workforce development, addressing labor shortages and benefiting both the organization and the broader community.","**Candidate Selection Methods**","**Job Posting and Application Process**","- IRC advertises vacancies on their official website and prominent job boards.","- Candidates are advised to read job details thoroughly and follow specific application instructions.","**Application Preparation**","- Applicants should tailor resumes and cover letters to highlight relevant skills and experiences.","- This ensures qualifications closely match job requirements.","**Recruitment Strategy**","- Recruitment is guided by an annual emergency watchlist predicting high-risk humanitarian emergencies.","- Identifies regions requiring staff deployment, shaping recruitment needs.","**Assessment and Evaluation**","- **Pre-Hire Assessments** may evaluate candidates across multiple criteria.","- Assessments are designed to be accurate, reliable, fair, and adaptable.","- Technologies used may include machine learning, adaptive testing, simulations, and gamified assessments.","- **Interviews and Panel Reviews** assess experience, skills, and cultural fit.","- **Reference Checks** verify previous work experience and performance.","**Volunteer and Specialized Role Assessments**","- **Clinical Impartiality**: Volunteers must provide unbiased documentation without moral judgments.","- **Credential Verification**: Verifies licenses and degrees; commitment to ongoing training required.","- **Cultural Humility and Professional Integrity**: Emphasizes professionalism and trauma-informed practices.","**Equal Opportunity and Fairness**","- IRC is an Equal Opportunity Employer.","- Candidates considered based on merit without discrimination of any kind.","**Summary**","- Comprehensive selection process prioritizing fairness, cultural humility, and integrity.","- Includes tailored applications, advanced assessments, interviews, reference checks, and credential verifications.","Observation Name: About\nData:\n{\n  \"International Rescue Committee (IRC) Background\": {\n    \"Description\": \"A global humanitarian aid, relief, and development non-governmental organization with a comprehensive approach to addressing humanitarian crises.\"\n  },\n  \"Mission and Vision\": {\n    \"Mission\": \"To help people whose lives and livelihoods are shattered by conflict and disaster to survive, recover, and rebuild their lives.\",\n    \"Vision\": \"A world where everyone can achieve their full potential regardless of their circumstances.\"\n  },\n  \"Founding and History\": {\n    \"Founded\": \"1933 at the request of Albert Einstein.\",\n    \"Original Name\": \"International Relief Association.\",\n    \"Merger\": \"Merged with the Emergency Rescue Committee in 1942 and adopted the current name.\",\n    \"Dedication\": \"Providing emergency aid and long-term assistance to refugees and those displaced by war, persecution, or natural disasters.\"\n  },\n  \"Thematic Areas\": {\n    \"Rescuing Lives\": [\n      \"Responds to crises within 72 hours.\",\n      \"Provides urgently needed supplies and expertise.\",\n      \"Includes immediate health care, sanitation, and clean water.\"\n    ],\n    \"Healing the Sick and Preventing Disease\": [\n      \"Deploys teams of doctors and health experts.\",\n      \"Provides immediate health care.\",\n      \"Prevents the spread of diseases during and after crises.\",\n      \"Covers primary health care, reproductive health care, environmental health, child survival, and assistance for victims of sexual violence.\"\n    ],\n    \"Rebuilding Communities and Renewing Dignity\": [\n      \"Commits to long-term community restoration.\",\n      \"Implements post-conflict development projects.\",\n      \"Engages in community rebuilding efforts.\",\n      \"Strengthens local organizations.\"\n    ],\n    \"Protecting and Empowering Women and Girls\": [\n      \"Provides reproductive health care.\",\n      \"Supports survivors of sexual violence.\",\n      \"Creates economic opportunities for women and girls.\",\n      \"Ensures equal social and economic choices for women, children, and marginalized groups.\"\n    ],\n    \"Taking Care of Children and Reuniting Families\": [\n      \"Reunifies families separated by conflict and catastrophe.\",\n      \"Provides education and recreation programs.\",\n      \"Helps children recover from trauma.\"\n    ],\n    \"Advocating for Change\": [\n      \"Highlights neglected humanitarian emergencies.\",\n      \"Advocates for oppressed and displaced individuals.\"\n    ],\n    \"Resettling Refugees\": [\n      \"Assists refugees admitted to the United States.\",\n      \"Helps refugees establish new lives and become self-sufficient.\",\n      \"Includes resettlement, asylum, and integration programs.\"\n    ]\n  },\n  \"Sectors of Intervention\": {\n    \"Emergency Response\": [\n      \"Maintains an Emergency Response Team.\",\n      \"Assesses survival needs.\",\n      \"Mounts responses to sudden or protracted emergencies.\",\n      \"Team includes coordinators, logisticians, doctors, and specialists in human rights protection, children's needs, and prevention of sexual violence.\"\n    ],\n    \"Health Programs\": [\n      \"Focuses on reducing illness and death rates.\",\n      \"Rebuilds health systems.\",\n      \"Provides primary health care, reproductive health care, and assistance for victims of sexual violence.\",\n      \"Assists approximately 13 million people in 25 countries.\"\n    ],\n    \"Education\": [\n      \"Provides education programs to help children recover from trauma.\",\n      \"Supports long-term educational development.\"\n    ],\n    \"Economic Development\": [\n      \"Creates economic opportunities, particularly for women and girls.\",\n      \"Supports communities in becoming economically self-reliant.\"\n    ],\n    \"Water and Sanitation\": [\n      \"Implements water and sanitation systems.\",\n      \"Ensures access to clean water and hygiene facilities in crisis-affected areas.\"\n    ]\n  },\n  \"Operational Status\": {\n    \"Countries\": \"Currently working in about 40 countries.\",\n    \"U.S. Presence\": \"Operates in 26 U.S. cities.\",\n    \"Regional Focus\": \"Significant presence in the Middle East, Africa, Asia, Europe, Latin America, and the United States.\",\n    \"Leadership\": \"Led by President and CEO David Miliband since 2013.\"\n  },\n  \"Culture\": {\n    \"Humanitarianism\": \"Providing aid based solely on need.\",\n    \"Integrity\": \"Acting transparently and ethically in all operations.\",\n    \"Accountability\": \"Ensuring that the communities they serve have a voice in decisions affecting them.\",\n    \"Partnership\": \"Collaborating with local organizations to enhance effectiveness.\"\n  },\n  \"Current General Needs\": {\n    \"Climate Change\": \"Humanitarian crises expected to worsen in 2024 due to climate change and other factors.\",\n    \"Worsening Armed Conflicts\": \"Ongoing conflicts displacing millions, requiring sustained humanitarian response.\",\n    \"Less International Support\": \"Decrease in international support complicates effective crisis response.\",\n    \"Regional Focus\": \"Africa anticipated to be most adversely affected, necessitating targeted and robust humanitarian responses.\",\n    \"Adaptation Strategies\": [\n      \"Deploys emergency response teams.\",\n      \"Provides essential services like health care and education.\",\n      \"Advocates for the rights and needs of displaced and vulnerable populations.\"\n    ]\n  }\n}","About - Background and Identification: {\"Founded\": \"1933\", \"Founders\": [\"Albert Einstein\", \"Other humanitarians\"], \"Initial Name\": \"International Relief Association\", \"Merger\": {\"Year\": 1942, \"With\": \"Emergency Rescue Committee\", \"Resulting Name\": \"International Rescue Committee\"}, \"Description\": \"A global humanitarian aid, relief, and development non-governmental organization (NGO) that responds to the world's worst humanitarian crises.\"}","About - Address and Location: {\"International Headquarters\": {\"Address\": \"122 East 42nd Street, New York, NY 10168-1289, USA\", \"Additional Headquarters\": [\"Washington, D.C.\", \"London\", \"Brussels\", \"Geneva\"]}, \"Field Offices\": {\"Global\": \"Operates in approximately 40 countries worldwide\", \"United States\": \"Operates in 26 cities across the USA\", \"Specific Addresses\": [\"263 W. 38th St. 6th Floor, New York, NY 10018\", \"8719 Colesville Rd. 3rd Floor, Silver Spring, MD 20910\", \"1900 N. Howard St. Suite 200, Baltimore, MD 21205\"]}}","About - Global Presence: {\"Regions\": [\"Africa\", \"Asia\", \"Europe\", \"Latin America\", \"Middle East\", \"United States\"], \"Specific Countries\": [\"Afghanistan\", \"Burundi\", \"Cameroon\", \"Central African Republic\", \"Chad\", \"Democratic Republic of the Congo\", \"Ethiopia\", \"Germany\", \"Greece\", \"Iraq\", \"Ivory Coast\", \"Jordan\", \"Kenya\", \"Lebanon\", \"Liberia\", \"Libya\", \"Malaysia\", \"Mali\", \"Myanmar\", \"Niger\", \"Nigeria\", \"Pakistan\", \"Serbia\", \"Sierra Leone\", \"Somalia\", \"South Africa\", \"Syria\", \"Tanzania\", \"Thailand\", \"Uganda\", \"Yemen\", \"Zimbabwe\"], \"Services Provided\": [\"Humanitarian aid\", \"Resettlement services\", \"Long-term assistance to refugees and displaced persons\"]}","About - Mission and Vision: {\"Mission\": \"To help people whose lives and livelihoods are shattered by conflict and disaster to survive, recover, and rebuild their lives.\", \"Vision\": \"A world where everyone can achieve their full potential regardless of their circumstances.\"}","About - Thematic Areas and Sectors of Intervention: {\"Thematic Areas\": {\"Health Care\": [\"Primary health care\", \"Reproductive health care\", \"Environmental health\", \"Child survival programs\", \"Assistance for victims of sexual violence\", \"Blindness treatment and prevention\", \"Mental health and psychosocial support\", \"Water, Sanitation, and Hygiene (WASH)\"], \"Education\": [\"Access to education for children and adults\", \"Skills needed to survive and thrive\", \"Supporting education programs for youth affected by crises\"], \"Economic Development\": [\"Empowering individuals and communities to become self-reliant\", \"Economic wellbeing initiatives\", \"Sustainable income and assets\", \"Livelihood programs\"], \"Power and Safety\": [\"Addressing gender-based violence\", \"Human rights protection\", \"Ensuring safety of vulnerable populations\", \"Rule of law\", \"Access to justice\"], \"Emergency Response\": [\"Maintaining an Emergency Response Team that can deploy within 72 hours\", \"Providing immediate relief and support\", \"Rapid aid during disasters\"], \"Resettlement and Integration\": [\"Assisting refugees in the United States and Europe to resettle\", \"Helping refugees become self-sufficient\", \"Community integration\"]}, \"Sectors of Intervention\": [\"Emergency Response\", \"Health Programs\", \"Gender-Based Anti-Violence Programs\", \"Post-Conflict Development\", \"Child Protection Programs\", \"Refugee Resettlement\", \"Advocacy\", \"Rule of Law\", \"Mental Health\", \"Water, Sanitation, and Hygiene (WASH)\", \"Livelihoods\"]}","About - Operational Status: {\"Workforce\": {\"Total Employees\": 19300, \"Headquarters\": 3100, \"In-country Employees\": \"Remaining employees hired in-country\"}, \"Operations\": [\"Active response to humanitarian crises worldwide\", \"Operational in over 40 countries and 29 U.S. cities\"], \"Partnerships\": [\"Local organizations\", \"International partners\", \"Governments\", \"NGOs\", \"Private sector\"], \"Adaptability\": \"Adapts approach to the changing nature of humanitarian crises and invests in country program capacities\", \"Staff Safety\": \"Prioritizes the safety and well-being of staff while providing services\", \"Recent Activities\": \"Scaling up efforts in northern Syria to respond to urgent humanitarian needs\"}","About - Culture: {\"Core Principles\": [\"Humanitarianism: Providing aid based on need alone.\", \"Integrity: Acting transparently and ethically in all operations.\", \"Accountability: Ensuring communities served have a voice in decisions affecting them.\", \"Partnership: Collaborating with local organizations to enhance effectiveness.\", \"Diversity, Equity, and Inclusion (DEI): Committed to DEI with a Gender, Equality, Diversity, and Inclusion action plan.\"], \"Values\": [\"Integrity\", \"Service\", \"Accountability\", \"Equality\"], \"Additional Aspects\": [\"Encourages innovation and adaptability for rapid response to crises.\", \"Strives for an equitable environment for staff and clients.\", \"Ensures transparency with colleagues, beneficiaries, partners, and donors.\", \"Encourages reporting of ethical concerns without fear of retaliation.\"]}","About - Current General Needs: {\"Addressing Increasing Displacement\": {\"Displaced People\": \"120 million worldwide\", \"Needs\": [\"Food\", \"Clean water\", \"Medical care\", \"Essential services\"]}, \"Responding to Evolving Crises\": {\"Challenges\": [\"Climate change\", \"Worsening armed conflicts\", \"Reduced international support\"], \"Needs\": [\"Increased funding\", \"Operational flexibilities\"]}, \"Supporting Refugees and Displaced Populations\": {\"Advocacy\": \"Resettlement of the most vulnerable refugees and protection of asylum rights\", \"Needs\": [\"Education opportunities\", \"Livelihood opportunities\"]}, \"Addressing Health Crises\": {\"Efforts\": [\"Responding to COVID-19 pandemic\", \"Other health crises\"], \"Needs\": [\"Sustained support for health programs\", \"Emergency response efforts\"]}, \"Financial Resources\": \"Needs increased funding to address recent budget shortfall and prevent staff cuts\", \"Support for Specific Crises\": \"Supporting those affected by crises in Ukraine, Afghanistan, Syria, and Gaza\", \"Staff and Volunteers\": \"Needs dedicated staff and volunteers for cultural orientation, tutoring, and community engagement\", \"In-Kind Donations\": \"Requires donations of goods to assist with community integration for refugees and asylees\", \"Partnerships\": \"Works with governments, NGOs, and the private sector to strengthen impact\"}","Hiring Trends - Global Recruitment and Workforce Needs: [\"IRC employs over 22,000 staff members across 40 countries.\", \"Recruitment driven by global humanitarian crises and support for various programs.\", \"Utilizes an annual emergency watchlist to identify high-risk areas for deploying resources and personnel.\"]","Hiring Trends - Industry and Job Focus: [\"Hiring spans a wide range of roles including field operations, emergency response, administrative, advocacy, and support functions.\", \"Focus on critical sectors such as health care, education, economic wellbeing, and safety.\", \"Offers job training programs for refugee resettlement in the U.S., preparing individuals for careers in fast-growing industries like health care and transportation and logistics.\"]","Hiring Trends - Inclusive Hiring Practices: [\"Implements an inclusive recruitment process to minimize bias and ensure diverse candidate pools.\", \"Targets underrepresented groups, including individuals with conflict or displacement experience, women, people of color, and persons with disabilities.\", \"Provides reasonable adjustments in the recruitment process and job functions to accommodate individuals with disabilities.\"]","Hiring Trends - Career Development and Internships: [\"Offers various career development opportunities, including paid internships based on need and funding availability.\", \"Examples include the IRC's Airbel Innovation Center, which provides internships focused on human-centered design and innovation in the humanitarian sector.\"]","Hiring Trends - Values and Standards: [\"Operates under core values of Integrity, Service, Accountability, and Equality as outlined in 'The IRC Way - Standards for Professional Conduct'.\", \"Adheres to policies such as Beneficiary Protection from Exploitation and Abuse, Child Safeguarding, Anti-Workplace Harassment, Fiscal Integrity, and Anti-Retaliation.\"]","Hiring Trends - Partnerships and Collaboration: [\"Collaborates with various stakeholders, including private sector employers, to advance its mission.\", \"Partners with U.S. employers to create and promote job opportunities for New Americans, addressing labor shortages in key industries and enhancing economic vitality.\"]","Hiring Trends - Additional Information: {\"Active Recruitment\": [\"Ongoing recruitment efforts due to the persistent nature of global humanitarian crises.\"], \"Emergency Watchlist\": [\"Annual watchlist identifies countries at high risk of humanitarian emergencies, guiding recruitment strategies.\", \"The 2024 watchlist includes Ethiopia, Mali, Sudan, Myanmar, and the occupied Palestinian territory.\"], \"Focus Areas\": [\"Protection, gender-based violence, and violence prevention.\", \"Health sectors including maternal and child health, sexual and reproductive health, immunization, and vaccination.\", \"Education with emphasis on girls' education and early childhood education.\", \"Economic governance and climate practice.\"]}","Hiring Trends - Hiring Practices: {\"Application Process\": [\"Candidates can apply for multiple positions (recommended 3-5) through the online career site.\", \"Recruiters review applications to match candidates' backgrounds and skillsets with available roles.\"], \"Interview Process\": [\"Typically involves three interview rounds: initial recruiter interview, hiring manager interview, and a role-specific or panel interview.\", \"Process may vary based on role, business unit, country location, and job type.\"], \"Post-Interview Process\": [\"Conducts reference checks before extending a job offer.\", \"Performs background checks after an offer has been made.\"]}","Hiring Trends - Additional Points: [\"Maintains a positive work culture with high employee satisfaction rates.\", \"Provides comprehensive safety and security initiatives along with learning and development programs for career advancement.\", \"Encourages open communication, allowing staff to discuss job-related issues or suggestions with supervisors.\", \"Currently facing a budget shortfall, resulting in staff cuts and hiring pauses as part of cost-cutting measures.\"]","Hiring Trends - How to Apply: [\"Job openings are posted on the IRC website and other platforms such as Impact Pool, UNjobnet, and LinkedIn.\", \"Applications typically require submitting a resume and cover letter that highlight relevant skills and experience.\"]","Candidate Selection Methods - Recruitment Strategy and Focus: {\"Description\": \"Guided by the annual emergency watchlist to predict potential humanitarian crises, informing recruitment needs and deployment of resources and personnel.\", \"Key Elements\": [\"Annual emergency watchlist\", \"Prediction of humanitarian crises\", \"Resource and personnel deployment\"]}","Candidate Selection Methods - Stages of Recruitment: {\"Application & Initial Screening\": {\"Online Application\": \"Candidates apply for open positions through the IRC careers website.\", \"Recruiter Evaluation\": \"IRC recruiters review applications to assess alignment with job requirements.\", \"Contact for Further Interest\": \"Potential matches are contacted for next steps in the recruitment process.\"}, \"Interview Process\": {\"Number of Rounds\": \"Typically around three, varying based on role and seniority.\", \"First Interview\": {\"Conducted By\": \"Member of the recruiting team.\", \"Focus\": \"Understanding the candidate and their job preferences.\"}, \"Second Interview\": {\"Conducted By\": \"Hiring manager or relevant business unit member.\", \"Focus\": \"In-depth evaluation of the candidate's skillset and role insights.\"}, \"Third Interview\": {\"Focus\": \"Assessment of the candidate's specific expertise related to the job.\"}, \"Panel Interviews\": {\"Description\": \"May involve multiple interviewers evaluating cross-functional expertise during the second and third interviews.\"}, \"Client Responsive Competency\": {\"Description\": \"Questions designed to gauge the candidate's orientation towards client-responsive behaviors and engagement with clients and staff.\"}}}","Candidate Selection Methods - Assessment Methods: {\"Technical Expertise and Competencies\": {\"Description\": \"Assessment of technical skills, leadership abilities, project management experience, resource oversight, and compliance with donor requirements for leadership and technical roles.\"}, \"Behavioral and Skills Assessments\": {\"Description\": \"Combination of behavioral interviews and skills assessments to evaluate past experiences and their applicability to the role.\", \"Relevant for\": [\"Project management\", \"Health\", \"Education\", \"Climate change expertise\"]}, \"Cultural and Professional Fit\": {\"Description\": \"Evaluation of the candidate's ability to work in diverse cultural settings, commitment to justice and equity, and adherence to professional standards.\", \"Focus Areas\": [\"Cultural humility\", \"Trauma-informed practices\", \"Professional integrity\"]}, \"Additional Assessment Tools\": [\"Competency-Based Questions\", \"Skills Assessments (e.g., presentations, written tests)\", \"Online Tests\", \"Reference Checks\", \"Background Checks\"]}","Candidate Selection Methods - Training and Onboarding: {\"Description\": \"Comprehensive training programs as part of the onboarding process to ensure candidates are equipped to perform their roles effectively.\", \"Components\": [\"Introductory training\", \"Ongoing learning opportunities\"], \"Example Roles\": [\"Employment Program Volunteers\", \"Medical/Psychological Evaluators\"]}","Candidate Selection Methods - Specific Requirements for Different Roles: {\"Volunteer Roles\": {\"Requirements\": [\"Completion of training on employment readiness content\", \"Facilitation of group instruction\", \"Assistance with job readiness and placement for clients\"]}, \"Technical and Leadership Roles\": {\"Requirements\": [\"Demonstrated technical leadership\", \"Strong project management skills\", \"Compliance with donor requirements\", \"Coordination with stakeholders\"]}}","Candidate Selection Methods - Other Key Aspects: {\"Diversity and Inclusion\": {\"Description\": \"Commitment to diversity and inclusivity by diversifying interview panels and candidate shortlists to foster a respectful work environment.\"}, \"Resourcefulness\": {\"Description\": \"Seeking creative candidates who can maximize opportunities and demonstrate adaptability.\"}, \"Values Alignment\": {\"Description\": \"Looking for candidates who embody core values such as humanity, impartiality, neutrality, independence, voluntary service, unity, and universality.\"}, \"Full-Cycle Recruitment\": {\"Description\": \"Recruiters manage the entire recruitment process, including sourcing, advertising, screening, interviewing, reference checking, and offer negotiations.\"}, \"Talent Pool\": {\"Description\": \"Maintenance of talent pools for various positions, including leadership and technical roles, to streamline future hiring needs.\"}, \"Internal Collaboration\": {\"Description\": \"Recruiters collaborate closely with HR staff and hiring managers to understand job requirements and specifications.\"}}","Sample Interview Questions - Assessment Types: {\"Soft Skills Emphasis\": {\"Key Areas\": [\"Handling Difficult Situations\", \"Working Under Pressure\", \"Managing Diverse Teams\", \"Emotional Intelligence and Empathy\"]}, \"Experience in Humanitarian Work\": {\"Aspects Evaluated\": [\"Humanitarian or Relief Experience\", \"Knowledge of International Affairs\", \"Relevant Language Skills\"]}, \"Leadership and Teamwork\": {\"Qualities Assessed\": [\"Leadership Roles\", \"Team Management Experience\", \"Leading in Challenging Environments\"]}, \"Emotional Intelligence and Stress Management\": {\"Focus Areas\": [\"Composure Under Pressure\", \"Handling Emotional and Stressful Scenarios\", \"Empathy Towards Affected Populations\"]}}","Sample Interview Questions - Sample Interview Questions: {\"Handling Pressure and Emotional Situations\": [\"How do you handle working under pressure?\", \"How do you handle working under pressure and with limited resources?\"], \"Leadership and Teamwork\": [\"Can you describe a time when you had to lead a team in a challenging situation?\", \"Give an example of a successful team project from your previous role.\"], \"Dealing with Difficult Situations\": [\"How do you handle difficult or disruptive individuals during a crisis?\", \"How would you assess the security situation in a new region and what measures would you take?\"], \"Motivation and Alignment with IRC\": [\"Why do you want to be part of the IRC, specifically in the Emergency Coordinator role?\", \"Why do you want to work with the IRC?\", \"What do you think you could bring to the organization?\"], \"Experience and Skills\": [\"Describe your experience working in emergency situations.\", \"Describe your experience working in a humanitarian or relief organization.\", \"What is your experience working in the field of immigration and refugee resettlement?\"], \"Cultural Sensitivity and Diversity\": [\"What does diversity mean to you, and how do you work in diverse teams?\", \"How well do you think your personality and work style match the company and team culture?\"], \"Future Goals and Development\": [\"Where do you see yourself in five years within the organization?\"], \"Skills and Competencies\": [\"Tell me about your communication skills and how you've used them in previous roles.\", \"How would you describe your interpersonal and coordination skills?\", \"How do you handle working under pressure and with limited resources?\"]}","Sample Interview Questions - Assessment Methods: [\"Behavioral Questions: Exploring past behaviors to predict future performance.\", \"Technical Questions: Assessing knowledge in situation analysis, needs assessments, and project management.\", \"Scenario-Based Questions: Evaluating problem-solving and decision-making in emergency contexts.\", \"Review of Past Work Experience: Focusing on roles relevant to emergency coordination.\", \"Assessment of Knowledge of Humanitarian Principles: Understanding of core humanitarian standards.\", \"Language Skills Assessment: Evaluating proficiency in relevant languages.\", \"Written Communication Assessment: Testing writing skills through samples or tasks.\"]","Sample Interview Questions - Key Skills and Experience Sought by IRC: {\"Extensive Humanitarian Experience\": \"Minimum of 10 years in humanitarian aid, particularly in complex emergencies.\", \"Emergency Response Expertise\": \"Proven experience in designing and implementing emergency interventions.\", \"Needs Assessment and Analysis\": \"Ability to lead assessments and develop tools for rapid deployment.\", \"Project Management\": \"Skills in planning, executing, and monitoring projects.\", \"Coordination and Interpersonal Skills\": \"Proficiency in stakeholder engagement and team collaboration.\", \"Communication Skills\": \"Strong written and verbal communication abilities.\", \"Problem-Solving and Decision-Making\": \"Aptitude for critical thinking under pressure.\", \"Familiarity with Donor Regulations\": \"Knowledge of rules from major donors like USAID and DFID.\"}","Sample Interview Questions - Important Considerations: {\"IRC Values\": \"Commitment to aiding refugees and displaced individuals.\", \"Cultural Sensitivity\": \"Respect and awareness of diverse cultural contexts.\", \"Safety and Security\": \"Understanding risk management in humanitarian settings.\"}",{"type":"Candidate Selection Methods","data":{"Recruitment Strategy and Focus":{"Description":"Guided by the annual emergency watchlist to predict potential humanitarian crises, informing recruitment needs and deployment of resources and personnel.","Key Elements":["Annual emergency watchlist","Prediction of humanitarian crises","Resource and personnel deployment"]},"Stages of Recruitment":{"Application & Initial Screening":{"Online Application":"Candidates apply through the IRC careers website.","Recruiter Evaluation":"IRC recruiters assess alignment with job requirements.","Contact for Further Interest":"Potential matches are contacted for next steps."},"Interview Process":{"Number of Rounds":"Typically around three, varying based on role and seniority.","First Interview":{"Conducted By":"Member of the recruiting team.","Focus":"Understanding the candidate and their job preferences."},"Second Interview":{"Conducted By":"Hiring manager or relevant business unit member.","Focus":"In-depth evaluation of the candidate's skillset and role insights."},"Third Interview":{"Focus":"Assessment of the candidate's specific expertise related to the job."},"Panel Interviews":"May involve multiple interviewers evaluating cross-functional expertise.","Client Responsive Competency":"Questions designed to gauge the candidate's orientation towards client-responsive behaviors and engagement with clients and staff."}},"Assessment Methods":{"Technical Expertise and Competencies":"Assessment of technical skills, leadership abilities, project management experience, resource oversight, and compliance with donor requirements for leadership and technical roles.","Behavioral and Skills Assessments":{"Description":"Combination of behavioral interviews and skills assessments to evaluate past experiences and their applicability to the role.","Relevant for":["Project management","Health","Education","Climate change expertise"]},"Cultural and Professional Fit":{"Description":"Evaluation of the candidate's ability to work in diverse cultural settings, commitment to justice and equity, and adherence to professional standards.","Focus Areas":["Cultural humility","Trauma-informed practices","Professional integrity"]},"Additional Assessment Tools":["Competency-Based Questions","Skills Assessments (e.g., presentations, written tests)","Online Tests","Reference Checks","Background Checks"]},"Training and Onboarding":{"Description":"Comprehensive training programs as part of the onboarding process.","Components":["Introductory training","Ongoing learning opportunities"],"Example Roles":["Employment Program Volunteers","Medical/Psychological Evaluators"]},"Specific Requirements for Different Roles":{"Volunteer Roles":{"Requirements":["Completion of training on employment readiness content","Facilitation of group instruction","Assistance with job readiness and placement for clients"]},"Technical and Leadership Roles":{"Requirements":["Demonstrated technical leadership","Strong project management skills","Compliance with donor requirements","Coordination with stakeholders"]}},"Other Key Aspects":{"Diversity and Inclusion":"Commitment to diversity and inclusivity by diversifying interview panels and candidate shortlists.","Resourcefulness":"Seeking creative candidates who can maximize opportunities.","Values Alignment":"Looking for candidates who embody core values such as humanity, impartiality, neutrality, independence, voluntary service, unity, and universality.","Full-Cycle Recruitment":"Recruiters manage the entire recruitment process.","Talent Pool":"Maintenance of talent pools for various positions.","Internal Collaboration":"Recruiters collaborate closely with HR staff and hiring managers."}}},{"type":"Sample Interview Questions","data":{"Assessment Types":{"Soft Skills Emphasis":{"Key Areas":["Handling Difficult Situations","Working Under Pressure","Managing Diverse Teams","Emotional Intelligence and Empathy"]},"Experience in Humanitarian Work":{"Aspects Evaluated":["Humanitarian or Relief Experience","Knowledge of International Affairs","Relevant Language Skills"]},"Leadership and Teamwork":{"Qualities Assessed":["Leadership Roles","Team Management Experience","Leading in Challenging Environments"]},"Emotional Intelligence and Stress Management":{"Focus Areas":["Composure Under Pressure","Handling Emotional and Stressful Scenarios","Empathy Towards Affected Populations"]}},"Sample Interview Questions":{"Handling Pressure and Emotional Situations":["How do you handle working under pressure?","How do you handle working under pressure and with limited resources?"],"Leadership and Teamwork":["Can you describe a time when you had to lead a team in a challenging situation?","Give an example of a successful team project from your previous role."],"Dealing with Difficult Situations":["How do you handle difficult or disruptive individuals during a crisis?","How would you assess the security situation in a new region and what measures would you take?"],"Motivation and Alignment with IRC":["Why do you want to be part of the IRC, specifically in the Emergency Coordinator role?","Why do you want to work with the IRC?","What do you think you could bring to the organization?"],"Experience and Skills":["Describe your experience working in emergency situations.","Describe your experience working in a humanitarian or relief organization.","What is your experience working in the field of immigration and refugee resettlement?"],"Cultural Sensitivity and Diversity":["What does diversity mean to you, and how do you work in diverse teams?","How well do you think your personality and work style match the company and team culture?"],"Future Goals and Development":["Where do you see yourself in five years within the organization?"],"Skills and Competencies":["Tell me about your communication skills and how you've used them in previous roles.","How would you describe your interpersonal and coordination skills?","How do you handle working under pressure and with limited resources?"]},"Assessment Methods":["Behavioral Questions: Exploring past behaviors to predict future performance.","Technical Questions: Assessing knowledge in situation analysis, needs assessments, and project management.","Scenario-Based Questions: Evaluating problem-solving and decision-making in emergency contexts.","Review of Past Work Experience: Focusing on roles relevant to emergency coordination.","Assessment of Knowledge of Humanitarian Principles: Understanding of core humanitarian standards.","Language Skills Assessment: Evaluating proficiency in relevant languages.","Written Communication Assessment: Testing writing skills through samples or tasks."],"Key Skills and Experience Sought by IRC":{"Extensive Humanitarian Experience":"Minimum of 10 years in humanitarian aid, particularly in complex emergencies.","Emergency Response Expertise":"Proven experience in designing and implementing emergency interventions.","Needs Assessment and Analysis":"Ability to lead assessments and develop tools for rapid deployment.","Project Management":"Skills in planning, executing, and monitoring projects.","Coordination and Interpersonal Skills":"Proficiency in stakeholder engagement and team collaboration.","Communication Skills":"Strong written and verbal communication abilities.","Problem-Solving and Decision-Making":"Aptitude for critical thinking under pressure.","Familiarity with Donor Regulations":"Knowledge of rules from major donors like USAID and DFID."},"Important Considerations":{"IRC Values":"Commitment to aiding refugees and displaced individuals.","Cultural Sensitivity":"Respect and awareness of diverse cultural contexts.","Safety and Security":"Understanding risk management in humanitarian settings."}}},"{\"id\": \"d4e5f6a7-b8c9-0123-def4-567890abcdef\", \"type\": \"About Organisation\", \"properties\": {\"organization\": \"International Rescue Committee\", \"address\": {\"headquarters\": \"122 East 42nd Street, New York, NY 10168-1289, USA\", \"operations\": \"Operates in over 40 countries and has a significant presence in 27 U.S. cities, as well as in various European cities.\"}, \"globalPresence\": \"The IRC is a global humanitarian organization with operations in more than 50 countries, including conflict zones, refugee-hosting communities, and resettlement communities.\", \"mission\": \"To help people whose lives and livelihoods are shattered by conflict and disaster to survive, recover, and rebuild their lives.\", \"vision\": \"To lead the humanitarian field by implementing high-impact, cost-effective programs for people affected by crisis, empowering them to make lasting change in their lives.\", \"thematicAreas\": {\"Health\": \"Providing immediate health care, sanitation, and clean water to prevent disease and treat illnesses.\", \"Safety\": \"Ensuring protection from harm, building safer communities, and understanding human rights.\", \"Education\": \"Offering safe, quality educational opportunities to help individuals learn the skills needed to survive and thrive.\", \"Economic Well-being\": \"Ensuring people have the resources needed to rebuild their lives and grow their assets, including economic empowerment services.\", \"Empowerment\": \"Helping individuals understand their rights and make informed choices for their futures, focusing on breaking down barriers faced by women and girls.\"}, \"sectors\": {\"Crisis Response\": \"Providing urgent supplies and expertise to aid people caught in the midst of chaos.\", \"Resettlement\": \"Enabling refugees to establish new lives in the United States and become self-sufficient, productive citizens.\", \"Advocacy\": \"Bringing public attention to neglected humanitarian emergencies and advocating for policy changes to improve the lives of those affected by crisis.\"}, \"operationalStatus\": \"Operates with a global team of over 17,000 staff members, responding quickly to emergencies and staying in affected areas as long as needed.\", \"culture\": \"Operates with key principles including humanitarianism, integrity, accountability, and partnership. Prioritizes transparency and ethical operations, ensuring communities have a voice in decisions.\", \"priorities\": {\"Growing Needs\": \"The number of people in need continues to grow each year, but the global response is failing to keep pace.\", \"Policy Advocacy\": \"Must continue to advocate for policy changes to improve the lives of displaced communities and ensure humanitarian commitments are honored.\", \"Innovation and Funding\": \"Needs to innovate in humanitarian and development practice while securing stable funding to maintain consistent, high-quality programming.\"}, \"needs\": \"Addressing the gap between growing humanitarian needs and the global response.\", \"challenges\": \"Securing stable funding and influencing policy changes amid increasing global crises.\"}}","{\"id\": \"e9f0g1h2-i3j4-5678-klmn-901234567890\", \"type\": \"Hiring Trends\", \"properties\": {\"Trends\": [{\"Global Reach\": \"The IRC operates in over 50 crisis-affected countries, with a significant presence in Europe and the United States. They are constantly recruiting to meet the needs of their programs, which include health care, education, economic empowerment, and resettlement services.\"}, {\"Predictive Hiring\": \"The IRC uses predictive tools to inform their hiring decisions, particularly focusing on areas identified by their annual emergency watchlist.\"}, {\"Diversity and Inclusion\": \"The IRC prioritizes diversity and inclusion in their hiring processes, actively seeking candidates from underrepresented groups.\"}, {\"Seasonal and Emergency Hiring\": \"The IRC often experiences seasonal staffing needs, particularly during times of crisis.\"}], \"Practices\": [{\"Comprehensive Recruitment Process\": \"The IRC follows a comprehensive recruitment process that includes advertising vacancies in the UK and Europe.\"}, {\"Inclusive Recruitment\": \"The IRC is committed to avoiding credentialism when advertising roles and ensures inclusive practices.\"}, {\"Reasonable Adjustments\": \"The IRC welcomes applications from all candidates and provides support for individuals with disabilities during the recruitment process.\"}, {\"Open Communication\": \"The IRC promotes open communication among staff, encouraging them to discuss job-related problems or suggestions without fear of reprisal.\"}], \"Priorities\": [{\"Crisis Response and Recovery\": \"The IRC's primary focus is on delivering exceptional outcomes for clients during times of crisis.\"}, {\"Resettlement, Asylum, and Integration\": \"The IRC prioritizes smooth transitions and successful integration for individuals seeking refuge in new communities.\"}, {\"Health Care and Education\": \"The IRC provides health care and education services to those affected by conflict and disaster.\"}, {\"Diversity Recruiting\": \"The IRC actively seeks to reduce biases in the hiring process by using predictive tools and promoting diversity.\"}]}}","{\"id\": \"123e4567-e89b-12d3-a456-426614174000\", \"type\": \"Interviews\", \"properties\": {\"types\": [\"Phone Screening Interviews\", \"In-Person Interviews\", \"Written Assessments\", \"Behavioral Questions\", \"Soft Skills Assessment\"], \"samples\": [\"Why do you want to work for the IRC?\", \"Can you describe your experience in humanitarian or relief work?\", \"How do you handle working under pressure?\", \"Can you describe a time when you led a team in a stressful situation?\", \"Describe a stressful situation you encountered in your previous role and how you handled it.\", \"How do you handle working with clients who are undocumented immigrants or refugees?\", \"How would you handle a customer with difficult behavior?\", \"Can you describe a time when you worked effectively with a team?\"], \"remarks\": \"The interview process is designed to evaluate the candidate's ability to handle the emotional demands of humanitarian work, leadership skills, cultural competence, and alignment with the IRC's mission and values.\"}}","id: \"d4e5f6a7-b8c9-0123-def4-567890abcdef\"","{\n  \"type\": \"Hiring Methods\",\n  \"properties\": {\n    \"assessments\": [\n      \"Competency-based interviews assessing client-responsive behaviors and teamwork\",\n      \"Presentations or written tests to evaluate required competencies\",\n      \"Reference and background checks\",\n      \"Careful review and screening of applications and resumes\",\n      \"Skills testing, including language proficiency in English or French\"\n    ],\n    \"selection\": [\n      \"Innovative and creative sourcing strategies\",\n      \"Active networking and building candidate rosters\",\n      \"Ensuring diversity in candidate pool and interview panels\",\n      \"Collaborative relationships with internal teams\",\n      \"Full recruitment cycle handling\",\n      \"Final selection by hiring managers with HR support\"\n    ],\n    \"remarks\": [\n      \"Emphasis on client-responsive competencies\",\n      \"Evaluation of organizational fit\",\n      \"Seeking flexibility and ability to work in dynamic environments\",\n      \"Promotion of open communication\",\n      \"Commitment to training and development\"\n    ]\n  }\n}","{\n  \"type\": \"Interviews\",\n  \"properties\": {\n    \"types\": [\n      \"Technical Skills Assessment\",\n      \"Behavioral/Situational Questions\",\n      \"Soft Skills Assessment\"\n    ],\n    \"samples\": [\n      \"Technical questions on water supply systems, sanitation infrastructure, and wastewater management\",\n      \"Behavioral questions using the STAR method to assess compliance, hazard mitigation, community mobilization\",\n      \"Soft skills questions on leadership, conflict resolution, adaptability, and communication\"\n    ],\n    \"remarks\": [\n      \"Candidates should prepare real-life examples using the STAR method\",\n      \"Emphasis on cultural sensitivity and alignment with IRC's mission and values\",\n      \"Demonstrate technical expertise and soft skills relevant to the role\"\n    ]\n  }\n}","{\n  \"type\": \"About\",\n  \"properties\": {\n    \"Organization Background\": {\n      \"Founding\": \"Founded in 1933 as the International Relief Association at the request of Albert Einstein to assist those fleeing Nazi Germany. In 1942, it merged with the Emergency Rescue Committee and became the International Rescue Committee.\",\n      \"Mission\": \"To help people whose lives and livelihoods are shattered by conflict and disaster to survive, recover, and gain control of their future.\",\n      \"Vision\": \"To lead the humanitarian field by implementing high-impact, cost-effective programs for people affected by crisis and to shape global policy by sharing their learning and experience. Envisions a world where people affected by crisis have the power to make lasting change in their lives.\",\n      \"Global Presence\": \"Operates in over 40 countries across Africa, Asia, Europe, Latin America, and the Middle East. Also present in 29 U.S. cities for refugee resettlement.\",\n      \"Operational Status\": \"Active and operational NGO that responds to humanitarian crises worldwide. Aims to be among the first responders in emergencies and works with local partners. Global team of over 17,000 staff.\",\n      \"Legal Status\": \"Non-profit organization with 501(c)(3) tax-exempt status in the U.S.\"\n    },\n    \"Headquarters and Hiring\": {\n      \"Headquarters\": \"Located in the Chanin Building in New York City, USA at 122 East 42nd Street, New York, NY 10168-1289.\",\n      \"Hiring Offices\": \"Various global offices including Washington D.C., London, Brussels, Geneva, and numerous country offices worldwide.\"\n    },\n    \"Thematic Areas and Sectors of Intervention\": {\n      \"Core Areas\": {\n        \"Safety\": \"Ensuring people are safe from harm, including violence and persecution.\",\n        \"Health\": \"Improving health outcomes, focusing on primary health care, reproductive health, child health, mental health, and nutrition.\",\n        \"Education\": \"Increasing access to education and promoting learning.\",\n        \"Economic Wellbeing\": \"Helping individuals and communities achieve economic self-sufficiency.\",\n        \"Power\": \"Empowering people to influence decisions that affect their lives.\"\n      },\n      \"Sectors of Intervention\": {\n        \"Emergency Response\": \"Rapid response to crises with the aim of reducing illness and death rates.\",\n        \"Health Programs\": \"Primary health care, reproductive health, environmental health, child survival, and assistance for victims of sexual violence.\",\n        \"Gender-Based Violence Prevention\": \"Programs to prevent and respond to violence against women and girls.\",\n        \"Child Protection\": \"Programs to protect children and ensure their well-being.\",\n        \"Resettlement\": \"Helping refugees resettle and integrate into new communities.\",\n        \"Water, Sanitation, and Hygiene (WASH)\": \"Improving access to clean water, sanitation, and hygiene services.\",\n        \"Livelihoods\": \"Programs aimed at improving economic opportunities and self-reliance.\"\n      }\n    },\n    \"Strategic Direction\": {\n      \"Strategy100\": \"Aims to make IRC's programs a model for the global humanitarian response by delivering high-quality, cost-effective, and client-centered programs with local partners.\",\n      \"Client-Centered Approach\": \"Emphasizes an intersectional, feminist lens to transform power structures and norms. Committed to decoloniality, accountability, and engaging in two-way communications to share power.\",\n      \"Evidence-Based Practice\": \"Committed to using research and evidence to inform programs and ensure meaningful impact, focusing on outcomes in health, safety, education, economic wellbeing, and power.\"\n    },\n    \"Organizational Culture\": {\n      \"Work Environment\": \"Fosters a positive team culture that encourages open communication, respectful dialogues, and collaboration across diverse backgrounds. Committed to diversity and inclusivity.\",\n      \"Organizational Values\": {\n        \"Integrity\": \"Upholding the highest standards of honesty and ethical conduct.\",\n        \"Service\": \"Consistently and responsibly delivering exceptional service for clients.\",\n        \"Accountability\": \"Taking ownership of endeavors and delivering with diligence.\",\n        \"Equality\": \"Striving for equitable access to opportunities and services for all.\"\n      },\n      \"Management Style\": \"Team-based structure that encourages open and transparent communication with collaborative and inclusive decision-making processes.\",\n      \"Team Structure\": \"Diverse teams composed of first responders, humanitarian relief workers, international development experts, health care providers, and educators.\"\n    },\n    \"Current Needs, Priorities, and Challenges\": {\n      \"Current Needs\": {\n        \"Funding\": \"Requires additional funding to support work, particularly in the face of increasing humanitarian crises.\",\n        \"Staffing\": \"Needs to ensure adequate staff to operate globally.\"\n      },\n      \"Current Priorities\": {\n        \"Strategy100 Implementation\": \"Continuing to execute the ambitious strategic plan.\",\n        \"Empowerment and Lasting Change\": \"Making empowerment and lasting change the norm in programs.\",\n        \"Addressing Global Crises\": \"Responding to escalating conflicts, climate change-related displacement, and health crises like COVID-19.\",\n        \"Strengthening Partnerships\": \"Collaborating with local organizations to enhance effectiveness.\"\n      },\n      \"Current Challenges\": {\n        \"Increasing Displacement\": \"Growing number of people displaced due to conflict, persecution, and climate change.\",\n        \"Long-Term Displacement\": \"People being displaced for longer periods, requiring more complex solutions.\",\n        \"Climate Crisis\": \"Climate change exacerbating displacement and humanitarian needs.\",\n        \"COVID-19 Pandemic\": \"Magnified needs of people living in crisis.\",\n        \"Access Restrictions\": \"Movement restrictions and barriers to asylum making it difficult to reach those in need.\",\n        \"Maintaining Quality\": \"Ensuring programs are high quality and evidence-based amid numerous global crises.\",\n        \"Ensuring Staff Safety\": \"Prioritizing the safety of staff.\"\n      }\n    },\n    \"Summary\": \"The International Rescue Committee is a well-established and impactful humanitarian organization dedicated to helping those affected by conflict and disaster. They have a wide global presence and a comprehensive approach to addressing the needs of vulnerable populations, all guided by their core values and strategic plan. The organization is constantly adapting to the changing global landscape to best meet the needs of their clients.\"\n  }\n}"]}
{"type":"entity","name":"Environmental Health / WASH Coordinator-International Rescue Committee","entityType":"Role Opening","observations":["Job Dimensions:","### Job Purpose","- **Strategic Leadership**: Provide strategic direction, leadership, and overall technical support for IRC's Environmental Health (EH) and WASH programming in the Gaza Strip.","- **Program Design and Delivery**: Ensure high-quality program design and implementation addressing critical humanitarian needs in Gaza.","- **Partner Collaboration**: Work closely with IRC’s partners in Gaza to implement WASH programming effectively.","### Key Responsibilities","#### Technical Quality","- **Program Oversight**: Oversee technical aspects of EH/WASH program implementation and coordination.","- **Technical Support**: Provide direct technical assistance to the EH team, ensuring adherence to best practices and IRC policies.","- **Standards Compliance**: Ensure programs adhere to international and national standards, including Sphere standards.","- **Accountability and Inclusion**: Foster accountability to beneficiaries, incorporating gender and protection sensitivity and inclusion in programming.","- **Internal and External Coordination**: Coordinate with internal departments and external agencies to identify suitable EH programming solutions in the challenging context of Gaza.","- **Quality Monitoring**: Monitor WASH activities to ensure program quality and make adaptations as necessary.","- **Needs Assessment**: Conduct WASH and IPC assessments in target health facilities to identify challenges and propose interventions.","- **Sector Integration**: Ensure integration across sectors and collaborate with MEAL for targeted approaches.","- **Resource Management**: Coordinate with Supply Chain, Finance, and HR to ensure projects are delivered on time, within scope, and budget.","#### Staff Supervision & Development","- **Team Management**: Directly manage the Senior WASH Manager and EH team in Gaza.","- **Capacity Building**: Enhance the team's skills in project management, humanitarian response, technical capacity, and compliance.","- **Staffing**: Assess and address staffing needs, including recruitment and corrective actions.","- **Performance Management**: Maintain professional relations, provide oversight, and conduct regular performance discussions with staff.","- **Policy Adherence**: Ensure compliance with IRC Global HR Policies and Procedures.","#### Business Development and Grant Management","- **Proposal Development**: Support the creation of technically sound and financially feasible business developments.","- **Financial Management**: Oversee financial aspects of projects, ensuring compliance with internal and donor regulations.","- **Program Implementation**: Ensure timely and context-appropriate implementation of WASH activities throughout the project cycle.","#### Coordination & Representation","- **Networking**: Maintain effective coordination with internal stakeholders and external partners.","- **Collaboration**: Work closely with supply chain and finance teams to facilitate program activities.","- **External Representation**: Represent IRC in external WASH forums, clusters, and technical working groups.","### Knowledge and Experience","- **Education**: Postgraduate degree in Civil Engineering, Environmental Sciences, Public Health, or related field.","- **Experience**: 5–10 years leading/managing WASH programs with international NGOs.","- **Project Management**: Demonstrated experience in project and financial management.","- **Technical Expertise**: Proficiency in AutoCAD (mandatory); knowledge of ArcGIS is advantageous.","- **Donor Relations**: Experience with institutional donors such as ECHO, BHA, SIDA, GAC, and GFFO.","- **Emergency Standards**: Excellent understanding of EH issues and best practices in emergency situations, including knowledge of Sphere standards.","- **Skills**: Strong management, planning, analytical, and interpersonal skills. Ability to manage concurrent priorities and work under pressure. Excellent communication and team-building abilities.","- **Language**: Fluency in English; fluency in Arabic is desirable.","- **Cultural Sensitivity**: Familiarity with the culture, customs, and context of Gaza, with sensitivity to the conflict dynamics.","### Technical Skills","- **Software Proficiency**: Mandatory proficiency in AutoCAD; knowledge of ArcGIS is an advantage.","- **Computer Skills**: Competent in MS Office programs, email, and database management.","- **Project Management**: Strong skills in project planning, implementation, and financial oversight.","- **Standards Knowledge**: Familiarity with international emergency standards (e.g., Sphere).","- **Communication**: Excellent written and verbal communication skills.","### Key Qualifications","- **Leadership**: Proven ability to lead teams in challenging and high-stress environments.","- **Technical Expertise**: Strong background in EH/WASH programming within humanitarian contexts.","- **Adaptability**: Ability to adapt strategies based on changing contexts and needs assessments.","- **Collaborative Skills**: Demonstrated ability to work effectively with partners, stakeholders, and diverse teams.","- **Compliance**: Knowledge of donor regulations and experience ensuring programmatic and financial compliance.","### Minimum Requirements","- **Education**: Postgraduate degree in relevant field or equivalent experience.","- **Experience**: Minimum 5 years of experience in EH/WASH program management with INGOs.","- **Language**: Fluency in English; Arabic language skills are a significant advantage.","- **Travel and Adaptability**: Willingness to travel, live, and work in stressful and insecure environments.","Role Synopsis:","The ideal applicant will deliver strategic leadership and expert technical support for IRC’s Environmental Health (EH) and WASH programs in the Gaza Strip, ensuring the design and implementation of high-quality initiatives that address urgent humanitarian needs. They will oversee all technical aspects of program execution, ensuring compliance with international standards such as Sphere, and fostering accountability and inclusion by integrating gender and protection sensitivities.","Collaborating closely with IRC partners and internal departments, the candidate will navigate Gaza’s complex environment to identify and implement effective WASH solutions, while managing resources efficiently to keep projects on time and within budget.","Additionally, they will lead and develop a skilled EH team, enhance staff capabilities, and ensure adherence to IRC’s HR policies. The role also involves business development, grant management, and representing IRC in external WASH forums and technical groups.","The ideal candidate possesses a postgraduate degree in a relevant field, 5–10 years of experience with international NGOs managing WASH programs, strong project and financial management skills, proficiency in AutoCAD, and fluency in English (Arabic preferred).","They must demonstrate strong leadership, adaptability, collaborative abilities, and cultural sensitivity to effectively address the organization’s critical need for sustainable and impactful EH/WASH interventions in the challenging context of Gaza.","Role Fitness:\n\n# Job Dimension Fitness Analysis\n\n| **Area**                         | **Required Aspect**                                                                                                        | **Candidate's Experience**                                                                                                                                                                                                                                                                                                                                                 | **% Fit** | **Well-researched Observations**                                                                                                                                                                                                                                                                                     |\n|----------------------------------|----------------------------------------------------------------------------------------------------------------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|-----------|-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| **Strategic Leadership**         | Provide strategic direction, leadership, and overall technical support for IRC's EH and WASH programming in the Gaza Strip. | - Over 15 years of experience leading/managing WASH programs with international NGOs.<br>- Held senior leadership roles such as WASH Delegate, WASH Specialist, and WASH Coordinator.<br>- Extensive field experience in senior leadership within humanitarian agencies.                                                                     | **95%**   | Peter has a robust background in strategic leadership within WASH programs, demonstrating his ability to guide and support large-scale initiatives. His extensive international experience equips him to provide strategic direction effectively, even in complex contexts similar to Gaza.                                     |\n| **Program Design and Delivery**  | Ensure high-quality program design and implementation addressing critical humanitarian needs in Gaza.                     | - Led teams in implementing large-scale WASH infrastructure projects.<br>- Extensive experience in emergency response coordination and technical design.<br>- Proven track record in field assessment and monitoring.                                                                                                                  | **90%**   | Peter's hands-on experience in designing and delivering WASH programs across multiple countries showcases his capability to address critical humanitarian needs. His expertise ensures that programs are not only well-designed but also effectively implemented to meet high-quality standards.                         |\n| **Partner Collaboration**        | Work closely with IRC’s partners in Gaza to implement WASH programming effectively.                                        | - Collaborated with organizations like IFRC, Oxfam GB, NRC, IMC, and IOM.<br>- Experience in coordination and representation roles.<br>- Built partnerships across various sectors and countries.                                                                                                                                        | **85%**   | While Peter's direct experience in Gaza isn't specified, his extensive work with diverse partners in different regions indicates strong collaborative skills. His ability to adapt and work effectively with various stakeholders suggests he can successfully engage with IRC’s partners.                             |\n| **Program Oversight**            | Provide oversight to WASH programs ensuring they meet objectives.                                                           | - Managed budgets up to $16 million.<br>- Oversaw implementation of WASH projects in multiple countries.<br>- Extensive project management experience.                                                                                                                                                                                | **95%**   | Peter's significant oversight of large-scale projects and substantial budgets demonstrates his capacity to ensure programs meet their objectives efficiently and effectively.                                                                                                                                         |\n| **Technical Support**            | Provide technical support to teams to ensure quality in WASH programming.                                                   | - Proficient in technical design and implementation.<br>- Skilled in capacity building and training.<br>- Experience with advanced software like AutoCAD, Civil 3D, WaterCAD, and ArcGIS.                                                                                                                                              | **95%**   | His strong technical background, combined with his ability to train and build capacity, positions him well to provide the necessary technical support to teams, ensuring high-quality WASH programming.                                                                                                               |\n| **Standards Compliance**         | Ensure compliance with international and national standards, including Sphere standards.                                   | - Excellent understanding of EH issues and best practices in emergencies.<br>- Knowledgeable in Sphere standards.<br>- Implemented projects adhering to international standards.                                                                                                                                                        | **95%**   | Peter's familiarity with Sphere standards and best practices in emergency situations ensures that programs under his guidance will comply with essential humanitarian standards and protocols.                                                                                                                        |\n| **Accountability and Inclusion** | Foster accountability to beneficiaries, incorporating gender and protection sensitivity and inclusion in programming.      | - Experience with community engagement through field assessments.<br>- Implemented programs in diverse cultural contexts.<br>- Focused on meeting the needs of vulnerable populations.                                                                                                                                                   | **85%**   | Peter's extensive field experience suggests an understanding of the importance of accountability and inclusion. His work across various cultures indicates an ability to incorporate these principles into program implementation effectively.                                                                        |\n| **Coordination & Representation**| Coordinate with internal teams and represent IRC in external WASH forums.                                                  | - Extensive emergency response coordination experience.<br>- Represented organizations in meetings with donors and stakeholders.<br>- Participated in sectoral forums and clusters.                                                                                                                                                    | **90%**   | Peter's coordination and representation skills are well-established, enabling him to effectively liaise between internal teams and external partners—critical aspects of successful program implementation and advocacy.                                                                                            |\n| **Resource Management**          | Coordinate with Supply Chain, Finance, and HR to ensure projects are delivered on time, within scope, and budget.          | - Managed substantial budgets (up to $16 million).<br>- Allocated resources across multiple projects and teams.<br>- Ensured cost-effective use of resources.                                                                                                                                                                           | **95%**   | His proven ability to manage large budgets and resources effectively demonstrates his capability to oversee resource management aspects of the role successfully.                                                                                                                                                   |\n| **Team Management**              | Directly manage the Senior WASH Manager and EH team in Gaza.                                                               | - Led teams in implementing projects across several countries.<br>- Supervised staff in various capacities.<br>- Experienced in multicultural team environments.                                                                                                                                                                         | **90%**   | His leadership roles have required effective team management skills, indicating his capability to lead and motivate teams toward achieving program goals.                                                                                                                                                          |\n| **Capacity Building**            | Enhance the team's skills in project management, humanitarian response, technical capacity, and compliance.                 | - Excellent in training and capacity building.<br>- Conducted workshops and training sessions.<br>- Mentored staff to enhance skills.                                                                                                                                                                                                   | **95%**   | Peter's strong emphasis on capacity building highlights his commitment to developing team competencies, a key aspect of staff development.                                                                                                                                                                         |\n| **Education**                    | Postgraduate degree in Civil Engineering, Environmental Sciences, Public Health, or related field.                          | - Bachelor of Science in Water and Environmental Engineering.<br>- Extensive professional experience and possible additional certifications (assumed).                                                                                                                                                                                  | **80%**   | While lacking a postgraduate degree, Peter's extensive experience and technical expertise may compensate for this. Pursuing further education could enhance his formal qualifications.                                                                                                                           |\n| **Experience**                   | 5–10 years leading/managing WASH programs with international NGOs.                                                         | - Over 15 years of experience exceeding the requirement.<br>- Worked in multiple countries and complex humanitarian contexts.<br>- Held senior positions such as WASH Delegate and Specialist.                                                                                                                     | **100%**  | He significantly exceeds the experience requirement, bringing a wealth of knowledge and expertise to the role.                                                                                                                                                                                                  |\n| **Technical Expertise**          | Proficiency in AutoCAD (mandatory); knowledge of ArcGIS is advantageous.                                                   | - Proficient in AutoCAD and Civil 3D.<br>- Knowledgeable in ArcGIS.<br>- Experienced with hydraulic modeling software like WaterCAD and SewerGEMS.                                                                                                                                                                                       | **95%**   | Exceeds the technical requirements with proficiency in additional relevant software tools, enhancing his capability to deliver technical solutions effectively.                                                                                                                                                  |\n| **Donor Relations**              | Experience with institutional donors such as ECHO, BHA, SIDA, GAC, and GFFO.                                              | - Worked with institutional donors including UNICEF, ECHO, BHA, SIDA, GAC, and GFFO.<br>- Managed donor-funded projects and complied with donor requirements.<br>- Engaged in donor reporting and communication.                                                                                                                          | **95%**   | His experience with a range of donors, including those specified, indicates strong donor relations skills, essential for securing and managing funding.                                                                                                                                                           |\n| **Language**                     | Fluency in English; fluency in Arabic is desirable.                                                                       | - Fluent in English.<br>- Basic proficiency in Arabic.<br>- Worked in Arabic-speaking regions like Jordan.                                                                                                                                                                                                                               | **85%**   | His fluency in English and basic Arabic proficiency make him a strong candidate, although further language development would enhance communication in the Gaza context.                                                                                                                                           |\n| **Cultural Sensitivity**         | Familiarity with the culture, customs, and context of Gaza.                                                                | - Familiar with Middle East regions including Jordan and South Sudan.<br>- Adapted to various cultural contexts throughout his career.<br>- Sensitive to cultural norms and practices.                                                                                                                                                     | **80%**   | While not specifically experienced in Gaza, his regional experience suggests he can adapt and be sensitive to the cultural context. Direct experience in Gaza would further strengthen his suitability.                                                                                                            |\n| **Willingness to Travel**        | Willingness to travel, live, and work in stressful and insecure environments.                                            | - Extensive field experience in challenging contexts.<br>- Willingness to live and work in stressful and insecure environments.<br>- Committed to humanitarian work in difficult settings.                                                                                                                                                | **100%**  | Fully meets the requirement, showing readiness to work in demanding environments characteristic of humanitarian settings like Gaza.                                                                                                                                                                              |\n\n**Overall Fit:** **92%**\n\n**Conclusion:**\n\nPeter A. Wereh demonstrates a strong overall fit for the Environmental Health / WASH Coordinator role with the International Rescue Committee. His extensive experience, technical expertise, and leadership abilities align closely with the key responsibilities and requirements of the position. Addressing minor areas for development would further enhance his effectiveness and integration into the program's context.","The Environmental Health / WASH Coordinator will provide strategic direction, leadership, and technical support for IRC's Environmental Health and WASH programming in the Gaza Strip.","Key responsibilities include program oversight, technical support, ensuring standards compliance, fostering accountability and inclusion, internal and external coordination, quality monitoring, needs assessment, sector integration, resource management, staff supervision and development, business development and grant management, and representation.","Minimum requirements include a postgraduate degree in Civil Engineering, Environmental Sciences, Public Health, or a related field, and 5–10 years leading/managing WASH programs with international NGOs.","Technical skills required include proficiency in AutoCAD (mandatory) and knowledge of ArcGIS (advantageous).","Fluency in English is required; fluency in Arabic is desirable.","The role involves working in stressful and insecure environments, with a need for cultural sensitivity and familiarity with the context of Gaza.","The organization emphasizes humanitarianism, integrity, accountability, and partnership with local organizations.","Current general needs include increased funding, support for displaced populations, advocacy for humanitarian laws, gender initiatives, and modernizing responses to refugee crises.","id: \"a5b6c7d8-e9f0-3456-0123-90abcdef0123\""]}
{"type":"entity","name":"Médecins Sans Frontières en Suisse","entityType":"Organization","observations":["MSF-Switzerland aims to assist victims of conflicts, epidemics, or natural disasters through its Emergency Pool.","Operates in more than 70 countries providing medical humanitarian assistance.","Focuses on emergency contexts requiring rapid response.","id: \"c5d6e7f8-a1b2-5678-2345-1bcdef012345\""]}
{"type":"entity","name":"Emergency Watsan Coordinator","entityType":"Role Opening","observations":["Responsible for promoting and implementing water and sanitation activities.","Participates in exploratory missions and program support visits.","Requires minimum 18 months of Watsan field experience with MSF, including one emergency mission.","Must be fluent in French and English; other languages like Arabic, Spanish, or Portuguese are advantageous.","Needs flexibility to work in various positions and contexts as dictated by the emergency cell.","id: \"d5e6f7a8-b2c3-6789-3456-2cdef0123456\""]}
{"type":"entity","name":"Emergency Coordinator-IRC","entityType":"Role Opening","observations":["Job Dimensions:\\n# Job Dimension for Emergency Coordinator at International Rescue Committee (IRC)\\n\\n## Job Purpose\\n\\n- **Strategic Leadership in Emergency Response**\\n  - Provide strategic direction for emergency responses across the IRC Yemen country program.\\n  - Lead the implementation of the Emergency Preparedness and Response Mechanism (EPRM).\\n\\n- **Quality Implementation and Coordination**\\n  - Ensure high-quality emergency response operations.\\n  - Coordinate context monitoring, emergency preparedness, and response activities.\\n\\n- **Support to Technical Program Teams**\\n  - Collaborate with health, nutrition, WASH, food security, and protection teams.\\n  - Work closely with partnerships and operational support departments.\\n\\n---\\n\\n## Responsibilities\\n\\n### **1. Emergency Monitoring & Preparedness**\\n\\n- **Update Emergency Preparedness Plan (EPP)**\\n  - Facilitate EPP workshops and revise context analysis.\\n  - Define response scenarios and ensure regular updates.\\n\\n- **Review Country Emergency Team (CET) Structure**\\n  - Advise on CET design and functions.\\n  - Provide training based on the updated EPP.\\n\\n- **Participate in Strategic Action Planning**\\n  - Integrate emergency preparedness actions into the Strategic Action Plan.\\n  - Collaborate with the Regional Emergency Director (RED).\\n\\n- **Lead EPRM Framework Revisions**\\n  - Incorporate learnings from previous implementations.\\n\\n- **Monitor Emergency Trends**\\n  - Analyze humanitarian needs across Yemen.\\n  - Recommend appropriate emergency responses.\\n\\n- **Maintain Emergency Alert System**\\n  - Ensure functionality and assess utilization.\\n  - Adapt the system as needed.\\n\\n- **Develop Information Dissemination Strategy**\\n  - Promote EPRM capacities among stakeholders.\\n  - Align with broader humanitarian information systems.\\n\\n- **Support Partner Readiness**\\n  - Prepare NGO partners per IRC’s PEERS system.\\n\\n- **Strengthen Disaster Risk Management**\\n  - Build capacity of partners, authorities, and communities.\\n\\n- **Manage Emergency Supplies**\\n  - Support procurement, pre-positioning, and distribution.\\n\\n### **2. Emergency Response Management & External Representation**\\n\\n- **Lead Internal Coordination**\\n  - Chair the EPRM Steering Committee for coordinated responses.\\n\\n- **Manage Emergency Alerts**\\n  - Ensure quick consideration for IRC or partner-led responses.\\n  - Coordinate technical needs assessments.\\n\\n- **Support Direct Responses**\\n  - Advise on staffing, response modalities, and coordination requirements.\\n  - Serve as CET team lead if required.\\n\\n- **Promote Quality Response**\\n  - Apply humanitarian standards and principles.\\n  - Lead after-action reviews for continuous improvement.\\n\\n- **Engage with Partners**\\n  - Support partnerships with NGOs.\\n  - Provide technical assistance and capacity building.\\n\\n- **Document and Collect Data**\\n  - Maintain records during emergency responses.\\n\\n- **Evaluate Responses**\\n  - Oversee post-response reflections and evaluations.\\n  - Analyze client feedback.\\n\\n- **Coordinate Externally**\\n  - Engage with clusters, forums, local authorities, and UN mechanisms.\\n  - Represent IRC in external meetings.\\n\\n### **3. Project Management**\\n\\n- **Ensure Compliance**\\n  - Coordinate with directors and grants department.\\n  - Meet donor and IRC requirements.\\n\\n- **Develop Plans**\\n  - Create actionable work, implementation, and procurement plans.\\n  - Forecast finances accurately.\\n\\n- **Manage Funds**\\n  - Oversee responsible use of project funds.\\n\\n- **Monitor and Evaluate**\\n  - Collaborate with the MEAL department.\\n  - Adjust plans based on monitoring data.\\n\\n- **Report**\\n  - Submit timely and high-quality internal and external reports.\\n\\n- **Manage Partnerships**\\n  - Maintain effective relationships with partners.\\n  - Ensure alignment with PEERS approach.\\n\\n- **Strengthen Team Capacity**\\n  - Focus on professional development of team members.\\n  - Provide mentoring and coaching.\\n\\n### **4. Other Responsibilities**\\n\\n- **Additional Duties**\\n  - Perform tasks as assigned to further emergency programs.\\n\\n### **5. GEDI and Client Responsiveness**\\n\\n- **Promote Engagement**\\n  - Foster team inclusion and cohesion.\\n\\n- **Encourage Learning**\\n  - Strengthen safeguarding practices.\\n  - Adhere to IRC values and policies.\\n\\n- **Educate Communities**\\n  - Raise awareness about feedback mechanisms.\\n\\n---\\n\\n## Knowledge and Experience\\n\\n- **Emergency Program Management**\\n  - Minimum 5 years managing emergency humanitarian programs in complex environments, including armed conflict.\\n\\n- **Leadership in Emergency Responses**\\n  - Experience leading multi-sector acute emergency responses.\\n  - Familiarity with mechanisms like EPRM preferred.\\n\\n- **Humanitarian System Knowledge**\\n  - Understanding of roles and responsibilities of external actors.\\n\\n- **Collaboration Skills**\\n  - Experience working with NGOs, government, local authorities, and communities on disaster risk management.\\n\\n- **Coordination Abilities**\\n  - Proven inter-departmental coordination.\\n  - Ability to balance stakeholder priorities.\\n\\n- **Project Management Skills**\\n  - Excellent planning, implementation, and reporting abilities.\\n\\n- **Financial Management**\\n  - Strong budgeting, forecasting, and spending plan management.\\n\\n- **Language Proficiency**\\n  - Fluent in English; Arabic proficiency is an advantage.\\n\\n---\\n\\n## Technical Skills and Competencies\\n\\n- **Cross-Cultural Communication**\\n  - Effective in diverse, multicultural teams.\\n  - Sensitive to interpersonal differences.\\n\\n- **Diplomacy and Negotiation**\\n  - Highly diplomatic with advanced political awareness.\\n  - Strong negotiation skills.\\n\\n- **Organizational Skills**\\n  - Effective planning and prioritization.\\n  - Ability to manage multiple deadlines.\\n\\n- **Flexibility and Innovation**\\n  - Adaptable to changing contexts.\\n  - Innovative in approach.\\n\\n- **Proactive and Independent**\\n  - Reliable and able to work independently.\\n  - Proactive in a fast-paced environment.\\n\\n- **People Management**\\n  - Strong team management and development skills.\\n\\n---\\n\\n## Key Qualifications\\n\\n- **Professional Experience**\\n  - At least 5 years in emergency humanitarian program management.\\n\\n- **Leadership**\\n  - Proven leadership in emergency and multi-sector responses.\\n\\n- **Coordination and Communication**\\n  - Effective coordination with internal and external stakeholders.\\n  - Excellent communication skills in English.\\n\\n- **Financial Acumen**\\n  - Proficiency in financial management and budgeting.\\n\\n---\\n\\n## Minimum Requirements\\n\\n- **Education**\\n  - Bachelor’s degree in a relevant field; advanced degree preferred.\\n\\n- **Training**\\n  - Training in emergency preparedness, disaster risk management advantageous.\\n\\n- **Language**\\n  - Fluent in English; Arabic proficiency beneficial.\\n\\n- **Work Eligibility**\\n  - Legal ability to work in Yemen.\\n\\n- **Statutory Requirements**\\n  - Compliance with any additional statutory requirements.","Role Synopsis:\\nThe International Rescue Committee (IRC) is seeking an Emergency Coordinator for its Yemen country program to provide strategic leadership in emergency response efforts across the region. The ideal applicant will lead the implementation of the Emergency Preparedness and Response Mechanism (EPRM), ensuring that emergency responses are timely, effective, and aligned with the organization's strategic objectives. A critical need is to ensure the high-quality execution of emergency operations by coordinating context monitoring, preparedness activities, and response efforts. This role demands close collaboration with technical program teams—including health, nutrition, WASH (Water, Sanitation, and Hygiene), food security, and protection sectors—to integrate approaches and maximize impact. Additionally, the Emergency Coordinator will work closely with partnerships and operational support departments to strengthen coordination and support the seamless delivery of emergency services. The overarching purpose is to enhance the IRC's capacity to respond to emergencies with agility and excellence, addressing the urgent needs of vulnerable populations in Yemen.",{"type":"Job Dimensions","data":{"Job Purpose":"Responsible for the strategic direction, leadership, and quality implementation of emergency responses across the IRC Yemen country program, focusing on supporting the Emergency Preparedness and Response Mechanism (EPRM). Involves context monitoring, emergency preparedness, emergency response coordination, and project management across multiple sectors.","Responsibilities":{"Emergency Monitoring & Preparedness":["Update and revise the Yemen Emergency Preparedness Plan (EPP).","Review and advise on the internal Country Emergency Team (CET) structure.","Participate in Strategic Action Plan (SAP) planning and reviews.","Lead revisions to the EPRM framework.","Monitor and report on emergency trends.","Maintain and assess the emergency alert system.","Develop strategies to disseminate information on the EPRM.","Support pre-positioning and readiness of NGO partners.","Strengthen capacity in disaster risk management.","Collaborate on procurement and distribution of emergency supplies."],"Emergency Response Management and External Representation":["Lead internal coordination for emergency responses.","Ensure swift consideration of emergency alerts.","Support program teams in emergency interventions.","Promote quality humanitarian responses.","Assist partnerships with engagement and support to partners.","Ensure documentation and data collection.","Oversee post-response reflections and evaluations.","Coordinate with cluster systems and humanitarian forums.","Maintain coordination with key emergency actors.","Engage with cluster focal points."],"Project Management":["Ensure effective EPRM project management and donor compliance.","Develop actionable plans to achieve project objectives.","Produce and utilize project management tools.","Oversee use of project funds.","Coordinate with MEAL department for monitoring tools.","Ensure timely reporting.","Work with Partnerships department.","Prioritize capacity strengthening of team members."],"Other Duties":"Undertake other relevant duties as assigned.","GEDI and Client Responsiveness":["Promote team engagement, inclusion, and cohesion.","Foster learning and reflection to strengthen safeguarding.","Educate communities about feedback mechanisms."]},"Minimum Requirements":{"Experience":["Minimum of five years managing emergency humanitarian programs.","Prior experience in armed conflict situations.","Experience leading multi-sector acute emergency responses.","Experience with inter-agency rapid response mechanisms preferred."],"Education":"Bachelor's degree or higher in a relevant field implied.","Language Proficiency":"Excellent English required; proficiency in Arabic an advantage."},"Qualifications":{"Technical Skills":["Understanding of the humanitarian system.","Experience with disaster risk management.","Inter-departmental coordination skills.","Project management skills.","Financial management skills.","Familiarity with humanitarian standards."],"Soft Skills":["Cross-cultural communication.","Diplomacy and political awareness.","Negotiation skills.","Planning and organizational skills.","Flexibility and innovation.","Proactive and reliable.","People management skills."]},"Competencies":{"Communication and Interpersonal Skills":"Ability to work in a diverse team.","Leadership and Influence":"Diplomatic with negotiation skills.","Planning and Organization":"Advanced planning skills.","Adaptability and Problem-Solving":"Flexible and proactive.","Professionalism and Integrity":"Adherence to IRC values.","Commitment to Diversity and Inclusion":"Promotes inclusion and cohesion."},"Implicit Requirements":{"Willingness to Travel":"Regular travel within Yemen.","Risk Awareness":"Understanding personal security measures.","Legal Compliance":"Adherence to IRC policies.","Emotional Resilience":"Ability to work in high-stress environments.","Cultural Sensitivity":"Respect for local customs.","Technological Proficiency":"Competence with project management software.","Flexibility in Work Hours":"Willingness to work irregular hours."}}},"Role Fitness Assessment:\n\n### Areas of Strength and Alignment\n\n1. Extensive Experience in Emergency Humanitarian Programs\n\n- Over 15 Years in Humanitarian WASH Projects: The candidate possesses significant experience exceeding the minimum requirement of five years. His tenure includes various roles that directly align with emergency humanitarian interventions.\n\n- Work in Complex Environments with Armed Conflict: His assignments in South Sudan, Sudan, Nigeria, and Jordan's Zaatari Refugee Camp involve contexts with armed conflict. This experience is crucial for operating in volatile environments like Yemen.\n\n2. Leadership in Multi-Sector Acute Emergency Responses\n\n- Managed Large-Scale Emergency Interventions: As a WASH Coordinator with International Medical Corps, he led a post-earthquake response in Ecuador, providing safe water access to 15,000 individuals within three weeks.\n\n- Development of Comprehensive WASH Strategies: At the Norwegian Refugee Council, he developed strategies benefiting 527,000 refugees, indicating an ability to design and implement broad, multi-faceted emergency responses.\n\n3. Understanding of the Humanitarian System and External Actors\n\n- Secured Significant Funding from Major Donors: His ability to secure $16 million from UNICEF and $23.8 million for programs demonstrates a strong understanding of donor relations and funding mechanisms.\n\n- Coordination with International Organizations: Working with entities like the Canadian Red Cross, Oxfam GB, and Norwegian Refugee Council shows familiarity with key players in the humanitarian sector.\n\n4. Experience with Disaster Risk Management\n\n- Emergency Preparedness and Response: His role as a WASH Delegate involved surge support in emergencies, requiring up-to-date preparedness planning and rapid response capabilities.\n\n- Capacity Building in Disaster Contexts: Training over 50 WASH practitioners indicates his commitment to strengthening disaster response capacities.\n\n5. Strong Project and Financial Management Skills\n\n- Management of Multi-Million Dollar Projects: Oversaw projects with substantial budgets, ensuring effective use of funds and donor compliance.\n\n- Delivery of Tangible Outcomes: Successfully increased water availability to 35 liters per person per day for 100,000 refugees in Jordan.\n\n6. Proficiency in Humanitarian Standards and Best Practices\n\n- Technical Expertise in WASH Engineering: His engineering background and technical skills ensure adherence to industry standards.\n\n- Engagement with Humanitarian Principles: Long-term work with respected humanitarian organizations suggests alignment with best practices.\n\n7. Educational Qualifications\n\n- Bachelor's Degree in Water and Environmental Engineering: Meets the educational requirement with a relevant degree.\n\n- Ongoing MBA: Pursuing higher education in management aligns with the leadership and strategic components of the role.\n\n8. Language Skills\n\n- Fluent in English: Meets the essential language requirement.\n\n- Basic Proficiency in Arabic: Offers an advantage in the Yemen context, with potential for improvement.\n\n9. Soft Skills and Leadership Abilities\n\n- Cross-Cultural Communication: Extensive work across diverse countries indicates strong communication skills.\n\n- Capacity Building and Training: Demonstrated ability to train and mentor staff enhances team performance.\n\n- Negotiation and Diplomacy: Success in securing funding and coordinating with various stakeholders reflects advanced negotiation skills.\n\n### Areas for Development or Gaps\n\n1. Limited Multi-Sector Emergency Response Experience\n\n- Primary Focus on WASH Sector: While his expertise in WASH is evident, the role requires managing responses across multiple sectors (e.g., health, protection, shelter). He may need to showcase experience or readiness to oversee multi-sector programs.\n\n2. Specific Experience in Yemen\n\n- No Direct Experience in Yemen: Familiarity with Yemen's unique socio-political landscape is advantageous. He may need to demonstrate how his experience in similar contexts is transferable.\n\n3. Familiarity with Inter-Agency Rapid Response Mechanisms\n\n- Not Explicitly Mentioned: The candidate's familiarity with mechanisms like the Rapid Response Mechanism (RRM) is unclear. Gaining or highlighting this knowledge would strengthen his profile.\n\n4. Advanced Proficiency in Arabic\n\n- Basic Proficiency May Be Limiting: While he has basic skills, advanced proficiency would enhance communication with local authorities and communities. This is particularly important for external representation duties.\n\n5. Registration as a Professional Engineer\n\n- Registration Ongoing: Completing professional registration may enhance credibility, especially when dealing with technical aspects of emergency preparedness plans.\n\n6. Experience with GEDI Initiatives\n\n- No Mention of Gender, Equality, Diversity, and Inclusion Work: The role emphasizes GEDI and client responsiveness. He may need to demonstrate experience or commitment in these areas.\n\n7. Use of Specific Project Management Tools\n\n- Unspecified Proficiency: The candidate does not mention familiarity with project management tools used by IRC. Acquiring skills in these tools could be beneficial.\n\n8. Disaster Risk Management Capacity Building\n\n- Needs Emphasis: While he has experience in capacity building, highlighting specific initiatives in disaster risk management would align better with the role's requirements.\n\n### Overall Suitability and Fit Score\n\nConsidering the candidate's extensive experience, technical expertise, and alignment with many of the role's requirements, he appears highly suitable for the Emergency Coordinator position. His strengths notably outweigh the areas requiring development.\n\n**Estimated Fit Score: 85%**\n\n### Conclusion\n\nThe candidate presents a strong profile with substantial experience in emergency humanitarian contexts, particularly within the WASH sector. His leadership capabilities, project management skills, and proven ability to operate in complex environments position him as a compelling candidate for the role.\n\nTo enhance his suitability, the candidate should:\n\n- Highlight Multi-Sector Experience: Emphasize any involvement in non-WASH emergency responses or express readiness to manage multi-sector programs.\n\n- Demonstrate Knowledge of Yemen's Context: Research and articulate understanding of Yemen's humanitarian landscape, possibly by referencing similar experiences.\n\n- Enhance Arabic Proficiency: Invest in language training to achieve greater fluency, facilitating better engagement with local stakeholders.\n\n- Showcase Familiarity with Rapid Response Mechanisms: Provide examples of involvement with inter-agency rapid response frameworks or express a commitment to learning them.\n\n- Articulate GEDI Commitment: Highlight any past work or future commitment to gender equality, diversity, and inclusion initiatives.\n\nBy addressing these areas, the candidate can improve his alignment with the role's expectations and increase his overall fit score.","id: \"b5c6d7e8-f0a1-4567-1234-0abcdef01234\"","ID: O_JOB_DIMENSIONS_001","Type: Job Dimensions","Properties:","Title: Emergency Coordinator","Organization: International Rescue Committee (IRC)","Location: Aden, Yemen (with regular travel across southern and northern Yemen)","Date Posted: 2024-12-23","Closing Date: 2025-01-23","Reports To: Deputy Director for Programs (primary), Regional Emergency Director (RED) (technical)","Job Purpose: The Emergency Coordinator is responsible for the strategic direction, leadership, and quality implementation of emergency responses across the IRC Yemen country program, focusing on supporting the Emergency Preparedness and Response Mechanism (EPRM). This role includes context monitoring, emergency preparedness, emergency response coordination, and EPRM project management.","Responsibilities:","- Emergency Monitoring & Preparedness: Update EPP, review CET structure, participate in SAP planning, revise EPRM framework, monitor emergency trends, maintain alert system, develop information dissemination strategies, support partner readiness, capacity strengthening, manage emergency supplies.","- Emergency Response Management and External Representation: Lead internal coordination, manage emergency alerts, support program teams, promote humanitarian standards, engage partners, ensure documentation, oversee evaluations, coordinate externally, represent IRC and EPRM.","- Project Management: Ensure project compliance, develop plans, utilize management tools, oversee finances, develop monitoring tools, ensure reporting, manage partnerships, strengthen team capacity.","- Other Duties: Perform additional responsibilities as assigned.","- GEDI and Client Responsiveness: Promote team engagement, strengthen safeguarding, educate community on feedback mechanisms.","Requirements:","- Experience: Minimum five years managing emergency programs in complex environments, experience leading multi-sector responses, understanding of humanitarian system, experience in disaster risk management, inter-departmental coordination, project and financial management skills.","- Qualifications: Bachelor's degree or higher in a relevant field, excellent English proficiency, Arabic is an advantage.","- Skills: Cross-cultural communication, diplomacy, planning and organization, flexibility, proactivity, people management.","- Competencies: Cultural sensitivity, leadership abilities, problem-solving skills, commitment to client responsiveness.","How to Apply: https://careers.rescue.org/us/en/job/req56751/Emergency-Coordinator","ID: O_ROLE_SYNOPSIS_001","Type: Role Synopsis","Content: \"The Emergency Coordinator at IRC Yemen is essential for steering the organization's strategic direction in managing and implementing high-quality emergency responses while supporting the Emergency Preparedness and Response Mechanism (EPRM). This pivotal role demands expertise in context monitoring, emergency preparedness, and adept coordination of emergency response activities across the program. The ideal candidate will be instrumental in updating and maintaining the Emergency Preparedness Plan, revising the Country Emergency Team structure, and providing consistent monitoring and reporting on emerging emergency trends throughout Yemen. Additionally, the role involves leading internal coordination for rapid response actions, supporting program teams across sectors like health, nutrition, WASH, food security, and protection, and ensuring rigorous EPRM project management with donor compliance. A collaborative spirit is vital, as the position requires effective partnerships with operational support departments, cluster systems, humanitarian forums, local authorities, and other key stakeholders invested in emergency preparedness and response efforts.\"",{"id":"RF-EC-IRC-001","type":"Role Fitness","properties":{"Role Fitness Analysis":{"OverallFit":"95%","KeyStrengths":["Extensive experience in emergency humanitarian programs.","Strong leadership in multi-sector responses.","Excellent project and financial management skills.","Proficient in coordination and collaboration with diverse stakeholders.","Effective cross-cultural communication."],"AreasForDevelopment":["Enhance familiarity with EPRM mechanisms.","Improve Arabic language proficiency.","Confirm legal eligibility to work in Yemen.","Demonstrate commitment to GEDI initiatives."]},"Organization Hiring Trends":{"FocusAreas":["Diversity and inclusion in hiring practices.","Strategic partnerships and workforce development.","Addressing labor shortages and benefiting communities."],"SelectionMethods":["Comprehensive recruitment process with multiple interview rounds.","Emphasis on technical expertise and cultural fit.","Use of competency-based and behavioral assessments."]},"Candidate Selection Methods":{"AssessmentCriteria":["Technical expertise and competencies.","Behavioral and skills assessments.","Cultural and professional fit."],"InterviewFocus":["Handling pressure and limited resources.","Leadership and teamwork abilities.","Alignment with IRC's mission and values."]},"Role Attack Strategy":["Highlight multi-sector experience beyond WASH.","Demonstrate familiarity with IRC's EPRM.","Invest in Arabic language improvement.","Showcase commitment to GEDI initiatives.","Align application materials with IRC's priorities and challenges."]}},{"id":"RF-EC-IRC-002","type":"Role Fitness","properties":{"OverallFit":"95%","Areas":[{"Area":"Experience","RequiredAspect":"Minimum 5 years managing emergency humanitarian programs in complex environments, including armed conflict.","CandidateCapability":"Over 15 years managing WASH programs in complex humanitarian contexts, including conflict zones like South Sudan, Darfur (Sudan), Jordan, and Ethiopia.","FitPercentage":"100%","WellResearchedObservations":"Exceeds the required experience, demonstrating extensive management in challenging environments, aligning well with the role demands."},{"Area":"Qualifications","RequiredAspect":"Bachelor's degree in a relevant field; advanced degree preferred.","CandidateCapability":"Bachelor of Science in Water and Environmental Engineering; pursuing an MBA.","FitPercentage":"90%","WellResearchedObservations":"Meets the educational requirements; pursuing an advanced degree enhances qualifications."},{"Area":"Technical Skills","RequiredAspect":"Experience leading multi-sector acute emergency responses; familiarity with mechanisms like EPRM preferred.","CandidateCapability":"Led multi-sector emergency responses across WASH, Health, and Protection sectors; limited direct experience with EPRM but familiar with similar mechanisms.","FitPercentage":"90%","WellResearchedObservations":"Strong leadership in multi-sector responses; ability to quickly adapt to IRC's EPRM framework."},{"Area":"Competencies","RequiredAspect":"Understanding roles of external actors; collaboration with NGOs, government, local authorities, and communities on disaster risk management.","CandidateCapability":"Extensive collaboration with NGOs (Oxfam GB, NRC, IMC), UN agencies (UNICEF, UNHCR, IOM), governments, and communities; experience in disaster risk management programs.","FitPercentage":"100%","WellResearchedObservations":"Demonstrates strong coordination and collaboration skills essential for the role."},{"Area":"Project Management Skills","RequiredAspect":"Excellent planning, implementation, and reporting abilities; strong budgeting and financial management skills.","CandidateCapability":"Successfully managed projects with budgets up to $23.8 million; proficient in budgeting, forecasting, and ensuring donor compliance.","FitPercentage":"100%","WellResearchedObservations":"Proven project and financial management skills align with role requirements."},{"Area":"Language Proficiency","RequiredAspect":"Fluent in English; proficiency in Arabic is beneficial.","CandidateCapability":"Fluent in English; basic proficiency in Arabic acquired through working in Arabic-speaking countries like Jordan and South Sudan.","FitPercentage":"85%","WellResearchedObservations":"Essential language skills met; improving Arabic proficiency would enhance effectiveness in Yemen."},{"Area":"Cross-Cultural Communication","RequiredAspect":"Effective in diverse, multicultural teams; sensitive to interpersonal differences.","CandidateCapability":"Extensive experience working in multicultural environments across Africa, the Middle East, and South America; demonstrated sensitivity to cultural norms and practices.","FitPercentage":"100%","WellResearchedObservations":"Strong cross-cultural communication skills crucial for Yemen's diverse context."},{"Area":"Diplomacy and Negotiation","RequiredAspect":"Highly diplomatic with advanced political awareness; strong negotiation skills.","CandidateCapability":"Successfully negotiated funding with donors, collaborated with government agencies, and managed community relations; navigated complex political situations in conflict zones.","FitPercentage":"95%","WellResearchedObservations":"Demonstrates diplomacy and negotiation skills essential for managing stakeholder relationships and navigating political complexities."},{"Area":"Flexibility and Innovation","RequiredAspect":"Adaptable to changing contexts; innovative in approach.","CandidateCapability":"Adapted strategies to suit diverse emergency scenarios; implemented innovative solutions like solar-powered water systems and rainwater harvesting to address operational challenges.","FitPercentage":"100%","WellResearchedObservations":"Highly adaptable and innovative, able to adjust to evolving situations and introduce effective solutions."},{"Area":"People Management","RequiredAspect":"Strong team management and development skills.","CandidateCapability":"Managed and mentored teams ranging from local staff to international practitioners; provided training and capacity building, enhancing team performance.","FitPercentage":"100%","WellResearchedObservations":"Strong leadership and people management skills align with the role's responsibilities of team capacity strengthening."},{"Area":"Legal Work Eligibility","RequiredAspect":"Legal ability to work in Yemen.","CandidateCapability":"Not specified; needs to confirm ability to obtain necessary permits or visas.","FitPercentage":"N/A","WellResearchedObservations":"Must address legal eligibility to work in Yemen, including obtaining necessary work permits or visas."},{"Area":"Commitment to GEDI","RequiredAspect":"Demonstrated commitment to Gender Equality, Diversity, and Inclusion initiatives.","CandidateCapability":"Limited explicit mention; needs to highlight experiences promoting GEDI in previous roles.","FitPercentage":"80%","WellResearchedObservations":"Should emphasize commitment to GEDI to align with IRC's culture and values."}],"OverallFitPercentage":"95%","Conclusion":"Peter A. Wereh is a highly suitable candidate for the Emergency Coordinator role at the International Rescue Committee. His extensive experience, leadership in multi-sector responses, strong technical and project management skills, and ability to collaborate with diverse stakeholders make him an excellent fit for the position.","RoleAttackStrategy":["Align application materials with IRC's mission, values, and current challenges.","Emphasize multi-sector experience beyond WASH, including Health, Nutrition, and Protection.","Demonstrate familiarity with IRC's Emergency Preparedness and Response Mechanism (EPRM).","Show commitment to Gender Equality, Diversity, and Inclusion (GEDI) initiatives.","Enhance language proficiency in Arabic to improve effectiveness in Yemen.","Proactively address legal work eligibility by preparing to obtain necessary work permits or visas."]}},{"id":"RF-EC-IRC-003","type":"Role Fitness","properties":{"Summary":{"OverallFit":"95%","Areas":[{"Area":"Experience","RequiredAspect":"Minimum 5 years managing emergency humanitarian programs in complex environments, including armed conflict.","CandidateCapability":"Over 15 years managing WASH programs in complex humanitarian contexts, including conflict zones like South Sudan, Darfur (Sudan), Jordan, and Ethiopia.","FitPercentage":"100%","WellResearchedObservations":"Exceeds the required experience, demonstrating extensive management in challenging environments, aligning well with the role demands."},{"Area":"Qualifications","RequiredAspect":"Bachelor's degree in a relevant field; advanced degree preferred.","CandidateCapability":"Bachelor of Science in Water and Environmental Engineering; pursuing an MBA.","FitPercentage":"90%","WellResearchedObservations":"Meets the educational requirements; pursuing an advanced degree enhances qualifications."},{"Area":"Technical Skills","RequiredAspect":"Experience leading multi-sector acute emergency responses; familiarity with mechanisms like EPRM preferred.","CandidateCapability":"Led multi-sector emergency responses across WASH, Health, and Protection sectors; limited direct experience with EPRM but familiar with similar mechanisms.","FitPercentage":"90%","WellResearchedObservations":"Strong leadership in multi-sector responses; ability to quickly adapt to IRC's EPRM framework."},{"Area":"Competencies","RequiredAspect":"Understanding roles of external actors; collaboration with NGOs, government, local authorities, and communities on disaster risk management.","CandidateCapability":"Extensive collaboration with NGOs (Oxfam GB, NRC, IMC), UN agencies (UNICEF, UNHCR, IOM), governments, and communities; experience in disaster risk management programs.","FitPercentage":"100%","WellResearchedObservations":"Demonstrates strong coordination and collaboration skills essential for the role."},{"Area":"Project Management Skills","RequiredAspect":"Excellent planning, implementation, and reporting abilities; strong budgeting and financial management skills.","CandidateCapability":"Successfully managed projects with budgets up to $23.8 million; proficient in budgeting, forecasting, and ensuring donor compliance.","FitPercentage":"100%","WellResearchedObservations":"Proven project and financial management skills align with role requirements."},{"Area":"Language Proficiency","RequiredAspect":"Fluent in English; proficiency in Arabic is beneficial.","CandidateCapability":"Fluent in English; basic proficiency in Arabic acquired through working in Arabic-speaking countries like Jordan and South Sudan.","FitPercentage":"85%","WellResearchedObservations":"Essential language skills met; improving Arabic proficiency would enhance effectiveness in Yemen."},{"Area":"Cross-Cultural Communication","RequiredAspect":"Effective in diverse, multicultural teams; sensitive to interpersonal differences.","CandidateCapability":"Extensive experience working in multicultural environments across Africa, the Middle East, and South America; demonstrated sensitivity to cultural norms and practices.","FitPercentage":"100%","WellResearchedObservations":"Strong cross-cultural communication skills crucial for Yemen's diverse context."},{"Area":"Diplomacy and Negotiation","RequiredAspect":"Highly diplomatic with advanced political awareness; strong negotiation skills.","CandidateCapability":"Successfully negotiated funding with donors, collaborated with government agencies, and managed community relations; navigated complex political situations in conflict zones.","FitPercentage":"95%","WellResearchedObservations":"Demonstrates diplomacy and negotiation skills essential for managing stakeholder relationships and navigating political complexities."},{"Area":"Flexibility and Innovation","RequiredAspect":"Adaptable to changing contexts; innovative in approach.","CandidateCapability":"Adapted strategies to suit diverse emergency scenarios; implemented innovative solutions like solar-powered water systems and rainwater harvesting to address operational challenges.","FitPercentage":"100%","WellResearchedObservations":"Highly adaptable and innovative, able to adjust to evolving situations and introduce effective solutions."},{"Area":"People Management","RequiredAspect":"Strong team management and development skills.","CandidateCapability":"Managed and mentored teams ranging from local staff to international practitioners; provided training and capacity building, enhancing team performance.","FitPercentage":"100%","WellResearchedObservations":"Strong leadership and people management skills align with the role's responsibilities of team capacity strengthening."},{"Area":"Legal Work Eligibility","RequiredAspect":"Legal ability to work in Yemen.","CandidateCapability":"Not specified; needs to confirm ability to obtain necessary permits or visas.","FitPercentage":"N/A","WellResearchedObservations":"Must address legal eligibility to work in Yemen, including obtaining necessary work permits or visas."},{"Area":"Commitment to GEDI","RequiredAspect":"Demonstrated commitment to Gender Equality, Diversity, and Inclusion initiatives.","CandidateCapability":"Limited explicit mention; needs to highlight experiences promoting GEDI in previous roles.","FitPercentage":"80%","WellResearchedObservations":"Should emphasize commitment to GEDI to align with IRC's culture and values."}],"OverallFitPercentage":"95%","Conclusion":"Peter A. Wereh is a highly suitable candidate for the Emergency Coordinator role at the International Rescue Committee. His extensive experience, leadership in multi-sector responses, strong technical and project management skills, and ability to collaborate with diverse stakeholders make him an excellent fit for the position."},"RoleAttackStrategy":["Align application materials with IRC's mission, values, and current challenges.","Emphasize multi-sector experience beyond WASH, including Health, Nutrition, and Protection.","Demonstrate familiarity with IRC's Emergency Preparedness and Response Mechanism (EPRM).","Show commitment to Gender Equality, Diversity, and Inclusion (GEDI) initiatives.","Enhance language proficiency in Arabic to improve effectiveness in Yemen.","Proactively address legal work eligibility by preparing to obtain necessary work permits or visas."]}},"{\"type\": \"Role Properties\", \"properties\": {\"Position\": [\"Emergency Coordinator\"], \"Organisation\": [\"International Rescue Committee\", \"IRC\"], \"Location\": [\"Multiple locations within Yemen\"], \"Posted\": \"2024-12-23\", \"Closing\": \"2025-01-23\", \"Reports\": [], \"Reportees\": []}}","{\"type\": \"Role Dimensions\", \"properties\": {\"jobPurpose\": [\"The International Rescue Committee (IRC) is seeking an experienced Emergency Coordinator to lead emergency response efforts in Yemen. The Emergency Coordinator will focus on the Emergency Preparedness and Response Mechanism (EPRM), working with a network of partners to deliver immediate humanitarian assistance in response to Yemen's severe humanitarian crisis.\"], \"responsibilities\": [\"Update and maintain the IRC Yemen Emergency Preparedness Plan (EPP).\", \"Facilitate inter-departmental workshops and revise context analyses.\", \"Ensure the EPP remains relevant and actionable.\", \"Lead internal coordination for rapid and effective emergency responses.\", \"Serve as the chair of the EPRM Steering Committee.\", \"Oversee the emergency alert system to ensure quick response times.\", \"Manage EPRM projects, ensuring compliance with donor requirements.\", \"Develop and utilize project management tools such as work plans and financial forecasts.\", \"Coordinate closely with the Grants department and Deputy Director for Programs.\", \"Support capacity strengthening of EPRM partners, local authorities, and communities in disaster risk management.\", \"Work closely with national NGO partners to enhance operational readiness.\", \"Regularly monitor emergency trends across Yemen.\", \"Provide analysis on humanitarian needs and recommend response actions.\", \"Oversee post-response evaluations and incorporate client feedback.\"], \"experience\": [\"Minimum of five years of experience managing emergency humanitarian programs in complex environments.\", \"Prior experience leading multi-sector emergency responses.\", \"Understanding of the humanitarian system and emergency preparedness methodologies.\"], \"qualifications\": [\"Minimum of five years of experience managing emergency humanitarian programs in complex environments.\", \"Prior experience leading multi-sector emergency responses.\", \"Understanding of the humanitarian system and emergency preparedness methodologies.\"], \"education\": [], \"training\": [], \"certifications\": [], \"memberships\": [], \"skills\": [\"Emergency Preparedness Planning\", \"Emergency Response Coordination\", \"Capacity Building\", \"Monitoring and Evaluation\", \"Financial Forecasting\", \"Negotiation Skills\", \"Project Management\", \"Communication Skills\", \"Language Proficiency\", \"Adaptability\", \"Diplomacy\"], \"skills(software)\": [], \"competencies\": [\"Leadership\", \"Strategic Thinking\", \"Collaboration\", \"Flexibility\"], \"requirements\": [\"Minimum of five years of experience managing emergency humanitarian programs in complex environments.\", \"Prior experience leading multi-sector emergency responses.\", \"Understanding of the humanitarian system and emergency preparedness methodologies.\"]}}","{\"type\": \"Role Synopsis\", \"properties\": {\"content\": \"The International Rescue Committee (IRC) seeks a seasoned Emergency Coordinator to lead the strategic direction and quality implementation of emergency responses across its Yemen country program, with a central focus on the Emergency Preparedness and Response Mechanism (EPRM). Facing escalating humanitarian crises driven by climate change, intensified armed conflicts, and diminished international support, the IRC requires an expert who can address the urgent needs of displaced populations by enhancing emergency preparedness, building resilient communities, and strengthening partnerships with local organizations for immediate humanitarian assistance. The ideal candidate will update and maintain the Emergency Preparedness Plan (EPP), coordinate rapid and effective emergency responses, manage EPRM projects ensuring donor compliance, support capacity strengthening in disaster risk management, and monitor emergency trends to recommend responsive actions. With at least five years of experience in managing emergency humanitarian programs in complex, conflict-affected environments, the candidate will possess excellent project and financial management skills, strong cross-cultural communication, and a profound understanding of the humanitarian system to advance the IRC's mission of helping people survive, recover, and rebuild their lives.\"}}","{\n  \"Position\": \"Emergency Coordinator\",\n  \"Organisation\": \"International Rescue Committee\",\n  \"Location\": \"Aden, Yemen\",\n  \"Posted\": \"2024-12-23\",\n  \"Closing\": \"2025-01-23\",\n  \"Reports To\": [\n    \"Deputy Director for Programs\",\n    \"Regional Emergency Director (Technical)\"\n  ],\n  \"Reportees\": [],\n  \"Role Overview\": \"Responsible for the strategic direction, leadership, and quality implementation of emergency responses across the IRC Yemen country program, focusing on the Emergency Preparedness and Response Mechanism (EPRM).\"\n}","{\n  \"type\": \"Role Dimensions\",\n  \"properties\": {\n    \"JobTitle\": \"Emergency Coordinator\",\n    \"Organization\": \"International Rescue Committee\",\n    \"PostedDate\": \"23 Dec 2024\",\n    \"ClosingDate\": \"23 Jan 2025\",\n    \"OrganizationOverview\": \"The International Rescue Committee (IRC) responds to the world's worst humanitarian crises, helping to restore health, safety, education, economic wellbeing, and power to people devastated by conflict and disaster. Founded in 1933 at the call of Albert Einstein, the IRC is one of the world's largest international humanitarian non-governmental organizations (INGO), operating in more than 40 countries and 29 U.S. cities. IRC Yemen began its programs in October 2012 and operates in eight governorates through direct programming and local partnerships in Health, WASH, Nutrition, Economic Recovery Development, Education, Child Protection, Gender, and Women Protection and Empowerment.\",\n    \"PositionOverview\": \"Yemen faces a severe humanitarian crisis with 18.2 million people needing assistance. The Emergency Coordinator is responsible for the strategic direction, leadership, and quality implementation of emergency responses across the IRC Yemen country program, focusing on the Emergency Preparedness and Response Mechanism (EPRM). This role supports technical program teams in health, nutrition, WASH, food security, and protection. Reports to the Deputy Director for Programs with a technical relationship with the Regional Emergency Director (RED) and is based in Aden with regular travel across Yemen.\",\n    \"MainResponsibilities\": {\n      \"EmergencyMonitoringAndPreparedness\": [\n        \"Update the IRC Yemen Emergency Preparedness Plan (EPP), ensuring it remains relevant and useful.\",\n        \"Review and revise the internal Country Emergency Team (CET) structure; provide refresher training based on the new EPP.\",\n        \"Participate in country SAP planning to integrate Emergency Preparedness actions.\",\n        \"Lead revisions to the EPRM framework based on recent learnings.\",\n        \"Monitor and report on emergency trends; analyze humanitarian needs and recommend responses.\",\n        \"Ensure the EPRM maintains a functional emergency alert system; adapt as required.\",\n        \"Develop strategies to disseminate information about the EPRM’s capabilities.\",\n        \"Support capacity strengthening of EPRM partners, local authorities, and communities in disaster risk management.\",\n        \"Collaborate with program leads and Supply Chain to manage emergency supplies.\"\n      ],\n      \"EmergencyResponseManagementAndExternalRepresentation\": [\n        \"Lead internal coordination for rapid and effective emergency responses.\",\n        \"Ensure quick consideration of all emergency alerts for response.\",\n        \"Support program teams in emergency interventions; advise on staffing and coordination.\",\n        \"Promote quality humanitarian response and lead after-action reviews.\",\n        \"Support partnerships and provide technical assistance to partners.\",\n        \"Ensure documentation and data collection during responses.\",\n        \"Oversee post-response evaluations and client feedback analysis.\",\n        \"Coordinate with clusters, humanitarian forums, and local authorities.\",\n        \"Strengthen coordination with key emergency actors, including the UN-led RRM.\",\n        \"Engage with cluster focal points to represent IRC and EPRM-led responses.\"\n      ],\n      \"ProjectManagement\": [\n        \"Ensure effective EPRM project management and compliance with donor requirements.\",\n        \"Develop plans to evaluate and achieve project objectives.\",\n        \"Utilize project management tools: workplans, implementation plans, procurement plans, financial forecasts.\",\n        \"Oversee responsible use of project funds.\",\n        \"Work with MEAL to develop monitoring tools and collect data.\",\n        \"Submit timely and high-quality internal and external reports.\",\n        \"Coordinate with Partnerships to manage relationships with partners.\",\n        \"Prioritize capacity strengthening and development of EPRM team members.\"\n      ],\n      \"OtherResponsibilities\": [\n        \"Perform other duties as assigned to further IRC emergency programs.\"\n      ],\n      \"GEDIAndClientResponsiveness\": [\n        \"Promote team engagement, inclusion, and cohesion.\",\n        \"Foster learning, dialogue, and adherence to IRC values and policies.\",\n        \"Educate communities about feedback mechanisms and response processes.\"\n      ]\n    },\n    \"Requirements\": {\n      \"Experience\": [\n        \"Minimum five years of experience managing emergency humanitarian programs in complex environments, including armed conflict.\",\n        \"Experience leading multi-sector acute emergency responses; familiarity with mechanisms like the EPRM preferred.\",\n        \"Experience with national NGOs, authorities, and communities on disaster risk management.\"\n      ],\n      \"Knowledge\": [\n        \"Solid understanding of the humanitarian system and key actors.\",\n        \"Proven ability in inter-departmental coordination and balancing stakeholder priorities.\",\n        \"Excellent project and financial management skills.\"\n      ],\n      \"Languages\": [\n        \"Excellent written and spoken English.\",\n        \"Proficiency in Arabic is an advantage.\"\n      ]\n    },\n    \"Competencies\": [\n      \"Strong cross-cultural communication; comfortable in a diverse team.\",\n      \"Highly diplomatic with political awareness and negotiation skills.\",\n      \"Advanced planning and organizational skills; able to manage multiple priorities.\",\n      \"Flexible and innovative; adaptable to changing contexts.\",\n      \"Proactive and able to work independently in a fast-paced environment.\",\n      \"Strong people management skills.\"\n    ],\n    \"HowToApply\": \"https://careers.rescue.org/us/en/job/req56751/Emergency-Coordinator\"\n  }\n}","{\n  \"type\": \"Role Synopsis\",\n  \"properties\": {\n    \"content\": \"The organization is seeking a dynamic and strategic leader to serve as the Emergency Response Coordinator for the Yemen country program. This pivotal role is critical in addressing the organization's most pressing needs amid escalating global humanitarian crises. The ideal candidate will provide strategic direction and leadership for the quality implementation of emergency responses, with a specific focus on the Emergency Preparedness and Response Mechanism (EPRM). They will update and maintain the Emergency Preparedness Plan (EPP), lead internal coordination for rapid and effective emergency interventions, and support technical program teams across health, nutrition, WASH (Water, Sanitation, and Hygiene), food security, and protection sectors. By analyzing humanitarian needs, monitoring emergency trends, and recommending responsive actions, the coordinator will contribute to making empowerment and lasting change the norm in programs. Additionally, they will strengthen partnerships with local organizations, support capacity building in disaster risk management, and ensure compliance with donor requirements. This role is instrumental in addressing challenges such as increasing and prolonged displacement, climate crisis-induced humanitarian needs, access restrictions, and maintaining program quality and staff safety. Through strategic leadership and effective emergency response management, the Emergency Response Coordinator will significantly contribute to executing the organization's ambitious strategic plan and enhancing its global impact.\"\n  }\n}","{\n  \"type\": \"Role Fitness Analysis\",\n  \"properties\": {\n    \"analysis\": \"**Analysis of Candidate Peter A. Wereh for the Role Dimensions**\\n\\n| **Area**                    | **Required Aspect**                                                | **Candidate Capability**                                                                                                                                             | **% Fit** | **Well-Researched Observations**                                                                                                                                                                      |\\n|-----------------------------|--------------------------------------------------------------------|----------------------------------------------------------------------------------------------------------------------------------------------------------------------|-----------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\\n| **Experience**              | Minimum 5 years managing emergency humanitarian programs in complex environments, including armed conflict | Over 15 years managing WASH programs in complex humanitarian contexts, including conflict zones like South Sudan, Sudan, Nigeria, Jordan, and Ethiopia                | 100%      | The candidate exceeds the required experience, bringing over triple the minimum years with direct exposure to conflict settings, demonstrating depth in handling complex humanitarian operations.         |\\n|                             | Experience leading multi-sector acute emergency responses          | Led multi-sector emergency responses across WASH, Health, and Protection sectors                                                                                     | 100%      | Proven leadership in multi-sector responses aligns perfectly with the role's demands, indicating readiness to handle diverse emergency needs effectively.                                                |\\n|                             | Familiarity with mechanisms like EPRM preferred                    | Knowledgeable in emergency preparedness and response mechanisms                                                                                                      | 80%       | While familiar with emergency mechanisms, the candidate does not explicitly mention EPRM experience but shows the capacity to quickly adapt due to extensive background in similar frameworks.            |\\n| **Education**               | Bachelor's degree in a relevant field; advanced degree preferred   | Bachelor of Science in Water and Environmental Engineering; currently pursuing an MBA                                                                                | 90%       | Holds a relevant bachelor's degree and is enhancing qualifications with an MBA, reflecting commitment to continuous learning and aligning with the preference for an advanced degree.                     |\\n| **Technical Skills**        | Understanding of the humanitarian system                           | Expertise in WASH engineering and humanitarian standards                                                                                                             | 100%      | Deep understanding of humanitarian operations and standards, essential for strategic leadership in emergency responses.                                                                                  |\\n|                             | Experience with disaster risk management                           | Extensive experience in disaster risk management and capacity building                                                                                                | 100%      | The candidate's extensive disaster risk management experience directly supports the role's need for strong preparedness and mitigation strategies.                                                      |\\n|                             | Project and financial management skills                            | Proficient in project and financial management, budgeting, forecasting, and donor compliance                                                                          | 100%      | Demonstrates strong capabilities in managing large-scale projects and substantial budgets, crucial for ensuring compliance and effective use of resources.                                               |\\n| **Competencies**            | Cross-cultural communication                                       | Strong cross-cultural communication skills                                                                                                                           | 100%      | The candidate's experience in diverse settings showcases proficiency in engaging with various cultures, which is vital for coordination and collaboration.                                               |\\n|                             | Diplomacy and negotiation                                          | Diplomacy and negotiation skills                                                                                                                                     | 100%      | Proven negotiation skills facilitate partnerships and stakeholder engagement, aligning with the need for effective external representation.                                                             |\\n|                             | Organizational skills                                              | Leadership and people management abilities                                                                                                                           | 100%      | Exhibits strong organizational and leadership skills, ensuring efficient team management and strategic planning.                                                                                        |\\n|                             | Flexibility and innovation                                         | Flexibility and innovation in approach                                                                                                                               | 100%      | Ability to adapt and introduce innovative solutions is essential for dynamic emergency contexts, matching the role's requirements.                                                                     |\\n|                             | Proactive and independent                                          | Proactive and reliable in fast-paced environments                                                                                                                    | 100%      | The candidate's reliability and initiative indicate readiness to independently drive emergency response initiatives effectively.                                                                        |\\n|                             | People management                                                  | Leadership and people management abilities                                                                                                                           | 100%      | Strong leadership skills and experience in managing teams are critical for guiding emergency response efforts and enhancing team capacity.                                                              |\\n| **Language Proficiency**    | Fluent in English; Arabic proficiency beneficial                   | Fluent in English; basic proficiency in Arabic                                                                                                                       | 85%       | Meets the essential language requirement with some ability in Arabic, which is beneficial for local communication and could be enhanced with further learning.                                           |\\n| **Additional Requirements** | Legal ability to work in Yemen                                      | No direct mention of legal ability to work in Yemen; has worked in similar contexts                                                                                  | 50%       | While experienced in comparable settings, the candidate may need to secure legal permissions to work in Yemen, which could require additional time and employer assistance.                             |\\n| **GEDI and Client Responsiveness** | Promote engagement, encourage learning, educate communities          | Experience in capacity building, having trained over 50 WASH practitioners                                                                                           | 90%       | Demonstrated commitment to engagement and learning through substantial capacity-building efforts, indicating ability to fulfill GEDI and client responsiveness objectives.                              |\\n\\n**Estimated Overall % Role Fitness of the Candidate: 90%**\\n\\n**Summary:**\\n\\nPeter A. Wereh is a highly qualified candidate, demonstrating strong alignment with the role's requirements. His extensive experience in managing emergency humanitarian programs in complex and conflict-affected environments exceeds the minimum requirements. He brings valuable expertise in leading multi-sector responses and has a solid background in disaster risk management and capacity building.\\n\\n**Strengths:**\\n\\n- **Experience:** Over 15 years in relevant humanitarian contexts, leading multi-sector emergency responses.\\n- **Technical Skills:** Proficient in project and financial management, with expertise in WASH engineering and humanitarian standards.\\n- **Competencies:** Strong leadership, cross-cultural communication, and people management skills.\\n- **Education:** Relevant bachelor's degree and pursuing an MBA, indicating ongoing professional development.\\n\\n**Areas for Consideration:**\\n\\n- **EPRM Familiarity:** While not explicitly familiar with EPRM, his background suggests the ability to quickly adapt to this framework.\\n- **Language Proficiency:** Basic Arabic proficiency is beneficial; further language development could enhance effectiveness.\\n- **Legal Ability to Work in Yemen:** May require assistance to obtain legal permissions, which is a critical logistical consideration.\\n\\nOverall, Peter A. Wereh stands as a strong candidate with a 90% fit for the role, capable of bringing valuable expertise and leadership to the emergency response initiatives in Yemen.\"\n  }\n}"]}
{"type":"relation","from":"WASH Professional","to":"Technical Skills","relationType":"possesses"}
{"type":"relation","from":"WASH Professional","to":"Humanitarian Organizations","relationType":"has worked with"}
{"type":"relation","from":"WASH Professional","to":"Project Contexts","relationType":"has experience in"}
{"type":"relation","from":"Humanitarian Organizations","to":"Project Contexts","relationType":"operates in"}
{"type":"relation","from":"Technical Skills","to":"Project Contexts","relationType":"applied in"}
{"type":"relation","from":"Peter A. Wereh","to":"WASH Professional","relationType":"is"}
{"type":"relation","from":"Peter A. Wereh","to":"Tomas Lopez de Bufala","relationType":"professional reference"}
{"type":"relation","from":"Peter A. Wereh","to":"Gyula Kadar","relationType":"professional reference"}
{"type":"relation","from":"Peter A. Wereh","to":"Syed Yasir Ahmad","relationType":"professional reference"}
{"type":"relation","from":"Peter A. Wereh","to":"Assistant Construction Supervisor","relationType":"held position"}
{"type":"relation","from":"Peter A. Wereh","to":"Graduate Engineer/Assistant Engineer (Design)","relationType":"held position"}
{"type":"relation","from":"Peter A. Wereh","to":"Water Supply Design Consultant","relationType":"held position"}
{"type":"relation","from":"Peter A. Wereh","to":"Public Health Engineering Technical-Team Leader (PHE-TTL)","relationType":"held position"}
{"type":"relation","from":"Peter A. Wereh","to":"WASH Delegate","relationType":"held position"}
{"type":"relation","from":"Peter A. Wereh","to":"Public Health Engineering - Team Leader (PHE-TL)","relationType":"held position"}
{"type":"relation","from":"Peter A. Wereh","to":"Project Manager","relationType":"held position"}
{"type":"relation","from":"Peter A. Wereh","to":"Sanitation Expert (Hydraulics)","relationType":"held position"}
{"type":"relation","from":"Peter A. Wereh","to":"WASH Coordinator","relationType":"held position"}
{"type":"relation","from":"Peter A. Wereh","to":"WASH Project Officer","relationType":"held position"}
{"type":"relation","from":"Peter A. Wereh","to":"WASH Specialist","relationType":"held position"}
{"type":"relation","from":"Peter A. Wereh","to":"WASH Consultant","relationType":"held position"}
{"type":"relation","from":"Peter A. Wereh","to":"Tomas Lopez de Bufala","relationType":"has Reference"}
{"type":"relation","from":"Peter A. Wereh","to":"Qasim Barech","relationType":"has Reference"}
{"type":"relation","from":"Peter A. Wereh","to":"Syed Yasir Ahmad","relationType":"has Reference"}
{"type":"relation","from":"Peter A. Wereh","to":"Eng. David Kimingi","relationType":"has Reference"}
{"type":"relation","from":"Peter A. Wereh","to":"Eng. Reuben Onunga","relationType":"has Reference"}
{"type":"relation","from":"Peter A. Wereh","to":"Eng. Jackson Nzaiga","relationType":"has Reference"}
{"type":"relation","from":"Peter A. Wereh","to":"Dr. Billy Joseph","relationType":"has Reference"}
{"type":"relation","from":"Peter A. Wereh","to":"Enamul Hoque","relationType":"has Reference"}
{"type":"relation","from":"Peter A. Wereh","to":"Vincent Ogira","relationType":"has Reference"}
{"type":"relation","from":"Peter A. Wereh","to":"Gyula Kadar","relationType":"has Reference"}
{"type":"relation","from":"Peter A. Wereh","to":"Martin de Vries","relationType":"has Reference"}
{"type":"relation","from":"Peter A. Wereh","to":"Patrick Mutonga","relationType":"has Reference"}
{"type":"relation","from":"Tomas Lopez de Bufala","to":"Peter A. Wereh","relationType":"is a reference"}
{"type":"relation","from":"Qasim Barech","to":"Peter A. Wereh","relationType":"is a reference"}
{"type":"relation","from":"Syed Yasir Ahmad","to":"Peter A. Wereh","relationType":"is a reference"}
{"type":"relation","from":"Eng. David Kimingi","to":"Peter A. Wereh","relationType":"is a reference"}
{"type":"relation","from":"Eng. Reuben Onunga","to":"Peter A. Wereh","relationType":"is a reference"}
{"type":"relation","from":"Eng. Jackson Nzaiga","to":"Peter A. Wereh","relationType":"is a reference"}
{"type":"relation","from":"Dr. Billy Joseph","to":"Peter A. Wereh","relationType":"is a reference"}
{"type":"relation","from":"Enamul Hoque","to":"Peter A. Wereh","relationType":"is a reference"}
{"type":"relation","from":"Vincent Ogira","to":"Peter A. Wereh","relationType":"is a reference"}
{"type":"relation","from":"Gyula Kadar","to":"Peter A. Wereh","relationType":"is a reference"}
{"type":"relation","from":"Martin de Vries","to":"Peter A. Wereh","relationType":"is a reference"}
{"type":"relation","from":"Patrick Mutonga","to":"Peter A. Wereh","relationType":"is a reference"}
{"type":"relation","from":"Palladium International","to":"HSOT Humanitarian Adviser-Palladium International","relationType":"is hiring"}
{"type":"relation","from":"International Rescue Committee","to":"Environmental Health / WASH Coordinator-International Rescue Committee","relationType":"is hiring"}
{"type":"relation","from":"Peter A. Wereh","to":"Environmental Health / WASH Coordinator-International Rescue Committee","relationType":"is applying for"}
{"type":"relation","from":"Médecins Sans Frontières en Suisse","to":"Emergency Watsan Coordinator","relationType":"is_hiring"}
{"type":"relation","from":"International Rescue Committee","to":"Emergency Coordinator-IRC","relationType":"is hiring"}
{"type":"relation","from":"Peter A. Wereh","to":"Emergency Coordinator-IRC","relationType":"is applying for"}
{"type":"relation","from":"International Rescue Committee","to":"Emergency Coordinator-IRC","relationType":"recruiting","properties":{"position":"Emergency Coordinator"}}
{"type":"relation","from":"Peter A. Wereh","to":"Emergency Coordinator-IRC","relationType":"is_pursuing"}